{
  "rsa": {
    "title": "Генератор ключевой пары RSA",
    "description": "Этот инструмент — это онлайн-генератор ключей RSA, предназначенный для того, чтобы помочь пользователям быстро создавать безопасные открытые и закрытые ключи RSA. RSA (Rivest-Shamir-Adleman) — это широко используемый криптографический алгоритм с открытым ключом, в основном применяемый для шифрования данных и цифровых подписей."
  },
  "MD5": {
    "title": "Шифрование MD5",
    "description": "Используйте MD5 (Message-Digest Algorithm 5) для выполнения хеширования текстового содержимого."
  },
  "SHA": {
    "title": "Шифрование SHA",
    "description": "Используйте SHA1, SHA3, SHA224, SHA256, SHA384, SHA512 для выполнения хеширования текстового содержимого."
  },
  "RIPEMD": {
    "title": "RIPEMD",
    "description": "Хеш-функция, основанная на структуре MD4, которая выводит 160-битное (20-байтное) хеш-значение."
  },
  "AESEncrypt": {
    "title": "Шифрование AES",
    "description": "Используйте алгоритм AES (Advanced Encryption Standard) для шифрования и расшифрования текста. AES — это симметричный алгоритм шифрования, основанный на сетях подстановок и перестановок."
  },
  "AESDecrypt": {
    "title": "Расшифровка AES",
    "description": "Используйте алгоритм AES (Advanced Encryption Standard) для шифрования и расшифрования текста. AES — это симметричный алгоритм шифрования, основанный на сетях подстановок и перестановок."
  },
  "base64EncodeDecode": {
    "title": "Base64 кодирование/декодирование",
    "description": "Инструмент кодирования/декодирования Base64 используется для кодирования двоичных данных в текстовую строку или декодирования текста, закодированного в Base64, обратно в двоичные данные. Обычно используется для передачи и хранения данных."
  },
  "CSVToJSON": {
    "title": "Конвертер CSV в JSON",
    "description": "CSV — это текстовый формат файла, который обычно используется для хранения табличных данных. Он состоит из значений, разделенных запятыми, каждое значение заключено в двойные кавычки, а каждая строка представляет собой запись."
  },
  "JSONToCSV": {
    "title": "Конвертер JSON в CSV",
    "description": "CSV — это текстовый формат файла, который обычно используется для хранения табличных данных. Он состоит из значений, разделенных запятыми, каждое значение заключено в двойные кавычки, а каждая строка представляет собой запись."
  },
  "YAMLToJSON": {
    "title": "Конвертер YAML в JSON",
    "description": "Конвертация YAML/JSON — это простой в использовании онлайн-инструмент, который преобразует файлы из формата YAML в формат JSON. Он обеспечивает бесшовное преобразование между JSON и YAML, что делает его удобным для пользователей, которым необходимо обрабатывать, передавать или проверять данные."
  },
  "JSONToYAML": {
    "title": "Конвертер JSON в YAML",
    "description": "Конвертация YAML/JSON — это простой в использовании онлайн-инструмент, который преобразует файлы из формата JSON в формат YAML. Он обеспечивает бесшовное преобразование между JSON и YAML, что делает его удобным для пользователей, которым необходимо обрабатывать, передавать или проверять данные."
  },
  "dateTimeConverter": {
    "title": "Конвертер даты и времени",
    "description": "Этот инструмент позволяет легко конвертировать различные форматы даты и времени."
  },
  "queryParamsToJSON": {
    "title": "Конвертер параметров запроса в JSON",
    "description": "Удобно преобразуйте параметры запроса URL в формат JSON, что облегчает их просмотр и использование."
  },
  "envToNetlifyToml": {
    "title": ".env в netlify.toml конвертер",
    "description": "Этот инструмент позволяет быстро и легко преобразовывать файлы конфигурации .env в файлы конфигурации TOML. TOML разработан как минимальный формат конфигурационных файлов, который легко читается и однозначно отображается на хеш-таблицы. TOML легко парсится в структуры данных на различных языках."
  },
  "imageToBase64Converter": {
    "title": "Конвертер изображений в Base64",
    "description": "Инструмент кодирования изображений в Base64 позволяет легко преобразовать различные форматы изображений в Base64. Просто перетащите изображение в указанную область, чтобы завершить операцию! Кодирование изображения в Base64 кодирует данные изображения в строку, позволяя использовать строку вместо URL изображения."
  },
  "integerBaseConverter": {
    "title": "Конвертер целочисленных оснований",
    "description": "Инструмент преобразования оснований позволяет пользователям конвертировать целые числа между любыми основаниями, с поддержкой таких часто используемых оснований, как 2, 8, 10, 16 и 64."
  },
  "colorConverter": {
    "title": "Конвертер цветов",
    "description": "Инструмент преобразования цветов позволяет пользователям быстро преобразовать их цветовые значения в другие форматы и предоставляет стандартное название цвета. Поддерживаемые форматы включают hex, rgb, hsl, hwb, lch и cmyk."
  },
  "caseConverter": {
    "title": "Конвертер регистра",
    "description": "Инструмент преобразования регистра позволяет быстро преобразовать текст в нужный формат. Очень удобно для преобразования соглашений об именовании, форматов заголовков и т.д. Включает верхний регистр, нижний регистр, camelCase, titleCase, constantCase, hyphenCase, PascalCase, pathCase и snake_case."
  },
  "textToUnicode": {
    "title": "Конвертер текста в Unicode",
    "description": "Инструмент преобразования текста в Unicode позволяет легко найти Unicode-код символа или найти символ, соответствующий Unicode-коду. Он может пакетно преобразовывать текст в Unicode-коды или пакетно преобразовывать Unicode-коды в текст."
  },
  "XMLToJSON": {
    "title": "Конвертер XML в JSON",
    "description": "Этот инструмент позволяет быстро преобразовывать XML в JSON. Расширяемый язык разметки (XML) позволяет определять и хранить данные в общем виде. XML поддерживает обмен информацией между компьютерными системами (например, веб-сайтами, базами данных и сторонними приложениями). Предопределенные правила упрощают процесс передачи данных в формате XML по любой сети, а получатель может использовать эти правила для точного и быстрого чтения данных."
  },
  "JSONToXML": {
    "title": "Конвертер JSON в XML",
    "description": "Этот инструмент позволяет быстро преобразовывать JSON в XML. Расширяемый язык разметки (XML) позволяет определять и хранить данные в общем виде. XML поддерживает обмен информацией между компьютерными системами (например, веб-сайтами, базами данных и сторонними приложениями). Предопределенные правила упрощают процесс передачи данных в формате XML по любой сети, а получатель может использовать эти правила для точного и быстрого чтения данных."
  },
  "markdownToHTML": {
    "title": "Конвертер Markdown в HTML",
    "description": "Этот инструмент позволяет быстро преобразовать ваш контент в формате Markdown в HTML, а также предоставляет возможность скачать его в виде PDF-файла."
  },
  "escapeHTMLEntities": {
    "title": "Экранирование HTML-сущностей",
    "description": "Экранируйте HTML-сущности, такие как <, >, &, \" и ', чтобы они могли быть безопасно вставлены в другие форматы кода, предотвращая ошибки."
  },
  "YAMLToTOML": {
    "title": "Конвертер YAML в TOML",
    "description": "Онлайн-инструмент для преобразования YAML в TOML позволяет легко конвертировать код в формате YAML в формат TOML."
  },
  "TOMLToYAML": {
    "title": "Конвертер TOML в YAML",
    "description": "Онлайн-инструмент для преобразования TOML в YAML позволяет легко конвертировать код в формате TOML в формат YAML."
  },
  "JSONToTOML": {
    "title": "Конвертер JSON в TOML",
    "description": "Этот инструмент позволяет пользователям легко преобразовывать данные JSON в конфигурации TOML, что полезно для пользователей, которым нужно преобразовывать различные форматы конфигурационных файлов."
  },
  "TOMLToJSON": {
    "title": "Конвертер TOML в JSON",
    "description": "Этот инструмент позволяет пользователям легко преобразовывать конфигурации TOML в формат JSON, что удобно для пользователей, которым нужно просматривать конфигурации TOML."
  },
  "JSONFormatter": {
    "title": "Форматировщик JSON",
    "description": "Просмотрщик JSON может улучшить внешний вид ваших данных JSON и предоставляет полезные функции, такие как поиск, сворачивание, разворачивание, замена, выделение и отображение путей."
  },
  "URLEncodeDecoder": {
    "title": "URL кодировщик/декодировщик",
    "description": "Чтобы разрешить использование определенного специального текста в URL, вы можете использовать этот инструмент для кодирования вашего URL. Вы также можете использовать этот инструмент для декодирования полученных URL."
  },
  "URLParser": {
    "title": "Парсер URL",
    "description": "Этот инструмент предназначен для того, чтобы пользователи могли четко и легко просматривать различные компоненты URL, такие как протокол, домен, порт, параметры запроса и т.д."
  },
  "MIMETypes": {
    "title": "Типы MIME",
    "description": "Этот инструмент позволяет пользователям быстро преобразовывать типы файлов в MIME-типы и обратно. Также предоставляет таблицу быстрого поиска."
  },
  "basicAuthGenerator": {
    "title": "Генератор базовой аутентификации",
    "description": "Быстро создавайте учетные данные базовой аутентификации, вводя имя пользователя и пароль, что удобно для отправки запросов в таких инструментах, как PostMan."
  },
  "XMLFormatter": {
    "title": "Форматировщик XML",
    "description": "Быстро форматируйте и выделяйте XML, что удобно для просмотра данных XML."
  },
  "JWTParser": {
    "title": "Парсер JWT",
    "description": "Быстро разбирайте JWT, чтобы получить заголовок, полезную нагрузку и подпись, что можно использовать для извлечения и проверки данных JWT, что удобно для отладки."
  },
  "tokenGenerator": {
    "title": "Генератор токенов",
    "description": "Случайным образом генерируйте токены на основе выбора пользователя типа символов и длины. Может включать заглавные и строчные буквы, цифры и специальные символы."
  },
  "passwordGenerator": {
    "title": "Генератор паролей",
    "description": "Генерируйте случайные надежные пароли в соответствии с вашими потребностями. Все операции выполняются локально в браузере, что гарантирует безопасность и конфиденциальность. Вы можете настраивать длину и включать заглавные, строчные буквы, цифры и специальные символы."
  },
  "hashText": {
    "title": "Хеширование текста",
    "description": "Шифруйте текст с использованием MD5, SHA1, SHA256, SHA224, SHA512, SHA384, SHA3 или RIPEMD160."
  },
  "bcrypt": {
    "title": "Bcrypt",
    "description": "Bcrypt — это адаптивная функция хеширования паролей. Она основана на алгоритме шифрования Blowfish и специально разработана для безопасного хранения паролей."
  },
  "encryptDecryptText": {
    "title": "Шифрование/расшифровка текста",
    "description": "Шифруйте и расшифровывайте текст с использованием AES, TripleDES, Rabbit или RC4."
  },
  "hmacGenerator": {
    "title": "Генератор HMAC",
    "description": "HMAC (код аутентификации сообщений на основе хеша) — это код аутентификации сообщений, основанный на хеш-функции и секретном ключе, используемый для проверки целостности и подлинности сообщений. HMAC может использоваться с различными хеш-функциями, такими как MD5, SHA-1, SHA-3, SHA-224, SHA-256, SHA-384, SHA-512 и RIPEMD160."
  },
  "crontabGenerator": {
    "title": "Генератор crontab",
    "description": "Введите выражение cron и переведите его в понятный язык, с таблицей быстрого справочника по выражениям cron."
  },
  "SQLFormatter": {
    "title": "Форматировщик SQL",
    "description": "Форматируйте неорганизованный SQL для облегчения чтения и понимания. Также можно улучшить внешний вид SQL перед отправкой кода, что упрощает его обслуживание."
  },
  "javascriptMinify": {
    "title": "Минификация JavaScript",
    "description": "Минификация JavaScript-кода — это процесс удаления всех ненужных символов из исходного кода без изменения его функциональности. Эти ненужные символы часто включают пробелы, разрывы строк, комментарии и разделители блоков, которые используются для улучшения читаемости кода, но не требуются для выполнения."
  },
  "YAMLFormatter": {
    "title": "Форматировщик YAML",
    "description": "Инструмент форматирования YAML может улучшить внешний вид и выделить конфигурации YAML, что повышает читаемость и упрощает обслуживание."
  },
  "MACAddressLookup": {
    "title": "Поиск MAC-адреса",
    "description": "Этот инструмент позволяет быстро и легко узнать производителя устройства на основе его MAC-адреса."
  },
  "textDiff": {
    "title": "Сравнение текста",
    "description": "Введите текст в два редактора, и алгоритм сравнения выделит различия, что очень удобно для пользователей, которым нужно сравнивать текст."
  },
  "xssDefence": {
    "title": "Защита от XSS",
    "description": "Этот инструмент определяет части вашего кода, которые могут быть уязвимы для XSS-атак, и выделяет их. Это очень полезно и удобно для изучения XSS и защиты от XSS-атак."
  }
}
