{
  "rsa": {
    "title": "Генератор пары ключей RSA",
    "description": "Этот инструмент — это онлайн-генератор ключей RSA, разработанный для того, чтобы помочь пользователям быстро генерировать безопасные открытые и закрытые ключи RSA. RSA (Rivest-Shamir-Adleman) — это широко используемый криптографический алгоритм с открытым ключом, в основном применяемый для шифрования данных и цифровых подписей.",
    "generate": "Сгенерировать пару ключей",
    "bits": "Биты",
    "public_key": "Открытый ключ",
    "private_key": "Закрытый ключ"
  },
  "MD5": {
    "title": "MD5 шифрование",
    "description": "Используйте MD5 (Message-Digest Algorithm 5) для выполнения хеш-вычислений на текстовом содержимом.",
    "from": "Ваша строка",
    "to": "Результат"
  },
  "SHA": {
    "title": "SHA шифрование",
    "description": "Используйте SHA1, SHA3, SHA224, SHA256, SHA384, SHA512 для выполнения хеш-вычислений на текстовом содержимом.",
    "algorithm": "Алгоритм",
    "hash_length": "Длина хеша",
    "from": "Ваша строка",
    "to": "Результат"
  },
  "RIPEMD": {
    "title": "RIPEMD",
    "description": "Хеш-функция, основанная на структуре MD4, выводящая 160-битное (20-байтное) хеш-значение.",
    "from": "Ваша строка",
    "to": "Результат"
  },
  "AESEncrypt": {
    "title": "AES шифрование",
    "description": "Используйте алгоритм AES (Advanced Encryption Standard) для шифрования и дешифрования текста. AES — это симметричный алгоритм шифрования, основанный на сетях подстановок и перестановок.",
    "tag_length": "Длина тега",
    "additional_data": "Дополнительные данные",
    "from": "Ваша строка",
    "to": "Зашифрованная строка"
  },
  "AESDecrypt": {
    "title": "AES дешифрование",
    "description": "Используйте алгоритм AES (Advanced Encryption Standard) для шифрования и дешифрования текста. AES — это симметричный алгоритм шифрования, основанный на сетях подстановок и перестановок.",
    "tag_length": "Длина тега",
    "additional_data": "Дополнительные данные",
    "from": "Зашифрованная строка",
    "to": "Дешифрованная строка"
  },
  "base64EncodeDecode": {
    "title": "Base64 кодирование/декодирование",
    "description": "Инструмент кодирования/декодирования Base64 используется для кодирования двоичных данных в текстовую строку или декодирования текстов, закодированных в Base64, обратно в двоичные данные. Обычно используется для передачи и хранения данных.",
    "encode_title": "В Base64",
    "decode_title": "Из Base64",
    "encode_from": "Ваша строка",
    "encode_to": "Закодированная строка",
    "decode_from": "Ваша строка Base64",
    "decode_to": "Декодированная строка"
  },
  "CSVToJSON": {
    "title": "Конвертер CSV в JSON",
    "description": "CSV — это текстовый файл, часто используемый для хранения табличных данных. Он состоит из значений, разделенных запятыми, и каждая строка представляет собой запись.",
    "lowercase": "ключи в нижнем регистре"
  },
  "JSONToCSV": {
    "title": "Конвертер JSON в CSV",
    "description": "CSV — это текстовый файл, часто используемый для хранения табличных данных. Он состоит из значений, разделенных запятыми, и каждая строка представляет собой запись."
  },
  "YAMLToJSON": {
    "title": "Конвертер YAML в JSON",
    "description": "Конвертер YAML/JSON — это простой в использовании онлайн-инструмент для преобразования файлов из формата YAML в формат JSON. Он позволяет легко переключаться между JSON и YAML, что удобно для работы с данными."
  },
  "JSONToYAML": {
    "title": "Конвертер JSON в YAML",
    "description": "Конвертер YAML/JSON — это простой в использовании онлайн-инструмент для преобразования файлов из формата JSON в формат YAML. Он позволяет легко переключаться между JSON и YAML, что удобно для работы с данными."
  },
  "dateTimeConverter": {
    "title": "Конвертер даты и времени",
    "description": "Этот инструмент позволяет легко конвертировать различные форматы даты и времени."
  },
  "queryParamsToJSON": {
    "title": "Конвертер параметров запроса в JSON",
    "description": "Удобно конвертируйте параметры URL-запроса в формат JSON, что упрощает их просмотр и использование."
  },
  "envToNetlifyToml": {
    "title": "Конвертер .env в netlify.toml",
    "description": "Этот инструмент позволяет быстро и легко конвертировать конфигурационные файлы .env в файлы конфигурации TOML. TOML разработан как минимальный формат конфигурационных файлов, который легко читать и однозначно сопоставлять с хеш-таблицами."
  },
  "imageToBase64Converter": {
    "title": "Конвертер изображений в Base64",
    "description": "Инструмент кодирования изображений в Base64 позволяет легко конвертировать различные форматы изображений в Base64. Просто перетащите изображение в указанную область для завершения операции! Кодирование изображения в Base64 преобразует данные изображения в строку, что позволяет использовать строку вместо URL-адреса изображения.",
    "image": "Изображение",
    "output": "Вывод Base64",
    "img_tag": "Использовать в теге <img>",
    "css": "Использовать в CSS"
  },
  "integerBaseConverter": {
    "title": "Конвертер систем счисления",
    "description": "Инструмент преобразования систем счисления позволяет пользователям конвертировать целые числа между различными системами счисления, включая такие популярные базы, как 2, 8, 10, 16 и 64.",
    "input": "Входное число",
    "input_base": "Система счисления"
  },
  "colorConverter": {
    "title": "Конвертер цветов",
    "description": "Инструмент преобразования цветов позволяет пользователям быстро конвертировать значения цветов в другие форматы и предоставляет стандартное название цвета. Поддерживаемые форматы включают hex, rgb, hsl, hwb, lch и cmyk."
  },
  "caseConverter": {
    "title": "Конвертер регистра",
    "description": "Инструмент преобразования регистра позволяет быстро преобразовывать текст в нужный формат. Это очень удобно для преобразования соглашений об именовании, форматов заголовков и т.д. Включает нижний регистр, верхний регистр, camelCase, titleCase, constantCase, hyphenCase, PascalCase, pathCase и snake_case.",
    "Lowercase": "Нижний регистр",
    "Uppercase": "Верхний регистр",
    "Camelcase": "Camelcase",
    "Capitalcase": "Capitalcase",
    "Constantcase": "Constantcase",
    "Dotcase": "Dotcase",
    "Pascalcase": "Pascalcase",
    "PascalSnakeCase": "PascalSnakeCase",
    "Nocase": "Nocase",
    "KebabCase": "KebabCase",
    "Pathcase": "Pathcase",
    "Sentencecase": "Sentencecase",
    "Snakecase": "Snakecase",
    "Mockingcase": "Mockingcase",
    "TrainCase": "TrainCase"
  },
  "textToUnicode": {
    "title": "Конвертер текста в Unicode",
    "description": "Инструмент преобразования текста в Unicode позволяет легко найти код Unicode для символа или найти символ, соответствующий коду Unicode. Может пакетно конвертировать текст в коды Unicode или пакетно конвертировать коды Unicode в текст.",
    "encode_title": "Текст в Unicode",
    "decode_title": "Unicode в текст",
    "encode_from": "Введите текст для преобразования в Unicode",
    "encode_to": "Unicode из вашего текста",
    "decode_from": "Введите Unicode для преобразования в текст",
    "decode_to": "Текст из вашего Unicode"
  },
  "XMLToJSON": {
    "title": "Конвертер XML в JSON",
    "description": "Этот инструмент позволяет быстро конвертировать XML в JSON. XML (Extensible Markup Language) позволяет определять и хранить данные в удобном для обмена виде. XML поддерживает обмен информацией между компьютерными системами (например, веб-сайтами, базами данных и сторонними приложениями). Предопределенные правила упрощают процесс передачи данных в формате XML через любую сеть, а получатель может использовать эти правила для точного и эффективного чтения данных."
  },
  "JSONToXML": {
    "title": "Конвертер JSON в XML",
    "description": "Этот инструмент позволяет быстро конвертировать JSON в XML. XML (Extensible Markup Language) позволяет определять и хранить данные в удобном для обмена виде. XML поддерживает обмен информацией между компьютерными системами (например, веб-сайтами, базами данных и сторонними приложениями). Предопределенные правила упрощают процесс передачи данных в формате XML через любую сеть, а получатель может использовать эти правила для точного и эффективного чтения данных."
  },
  "markdownToHTML": {
    "title": "Конвертер Markdown в HTML",
    "description": "Этот инструмент позволяет быстро конвертировать ваш контент в формате Markdown в HTML и предоставляет возможность скачать его в виде PDF-файла."
  },
  "escapeHTMLEntities": {
    "title": "Экранирование HTML-сущностей",
    "description": "Экранирование HTML-сущностей, таких как <, >, &, \" и ', чтобы они могли быть безопасно вставлены в другие форматы кода, предотвращая ошибки.",
    "escape_title": "Экранировать HTML-сущности",
    "unescape_title": "Деэкранировать HTML-сущности",
    "escape_from": "Ваша строка",
    "escape_to": "Экранированная строка",
    "unescape_from": "Ваша экранированная строка",
    "unescape_to": "Деэкранированная строка"
  },
  "YAMLToTOML": {
    "title": "Конвертер YAML в TOML",
    "description": "Онлайн-инструмент YAML в TOML позволяет легко конвертировать код в формате YAML в формат TOML."
  },
  "TOMLToYAML": {
    "title": "Конвертер TOML в YAML",
    "description": "Онлайн-инструмент TOML в YAML позволяет легко конвертировать код в формате TOML в формат YAML."
  },
  "JSONToTOML": {
    "title": "Конвертер JSON в TOML",
    "description": "Этот инструмент позволяет пользователям легко конвертировать данные JSON в конфигурацию TOML, что полезно для тех, кто нуждается в преобразовании между различными форматами конфигурационных файлов."
  },
  "TOMLToJSON": {
    "title": "Конвертер TOML в JSON",
    "description": "Этот инструмент позволяет пользователям легко конвертировать конфигурации TOML в формат JSON, что удобно для тех, кто нуждается в просмотре конфигураций TOML."
  },
  "JSONFormatter": {
    "title": "Форматировщик JSON",
    "description": "Просмотрщик JSON может улучшить внешний вид ваших данных JSON и предоставляет полезные функции, такие как поиск, сворачивание, разворачивание, путь, замена и выделение."
  },
  "URLEncodeDecoder": {
    "title": "URL кодировщик/декодировщик",
    "description": "Чтобы использовать определенный специальный текст в URL, вы можете использовать этот инструмент для кодирования вашего URL. Вы также можете использовать этот инструмент для декодирования полученных URL-адресов.",
    "encode_title": "Кодировщик URL",
    "decode_title": "Декодировщик URL"
  },
  "URLParser": {
    "title": "Разборщик URL",
    "description": "Этот инструмент предназначен для того, чтобы пользователи могли четко и легко просматривать различные компоненты URL, такие как протокол, домен, порт, параметры запроса и т.д.",
    "your_url": "Ваш URL для разбора"
  },
  "MIMETypes": {
    "title": "Типы MIME",
    "description": "Этот инструмент позволяет пользователям быстро конвертировать между типами файлов и типами MIME. Он также предоставляет таблицу быстрого поиска.",
    "mime_to_extension": "Тип MIME в расширение",
    "mime_to_extension_desc": "Узнайте, какие расширения файлов связаны с типом MIME",
    "extension_to_mime": "Расширение файла в тип MIME",
    "extension_to_mime_desc": "Узнайте, какой тип MIME связан с расширением файла"
  },
  "basicAuthGenerator": {
    "title": "Генератор базовой аутентификации",
    "description": "Быстро создавайте учетные данные для базовой аутентификации, вводя имя пользователя и пароль, что удобно для отправки запросов в таких инструментах, как PostMan."
  },
  "XMLFormatter": {
    "title": "Форматировщик XML",
    "description": "Быстро форматируйте и выделяйте XML, что полезно для просмотра данных XML.",
    "indent": "Размер отступа",
    "collapse": "Свернуть содержимое"
  },
  "JWTParser": {
    "title": "Разборщик JWT",
    "description": "Быстро разбирайте JWT, чтобы получить заголовок, полезную нагрузку и подпись, что можно использовать для извлечения и проверки данных JWT, полезно для отладки.",
    "uppercase": "Прописные",
    "lowercase": "Строчные",
    "number": "Цифры",
    "symbols": "Символы",
    "length": "Длина",
    "generate": "Сгенерировать"
  },
  "tokenGenerator": {
    "title": "Генератор токенов",
    "description": "Случайным образом генерируйте токены на основе выбранных пользователем типов символов и длины. Может включать прописные, строчные буквы, цифры и специальные символы.",
    "uppercase": "Прописные",
    "lowercase": "Строчные",
    "number": "Цифры",
    "symbols": "Символы",
    "length": "Длина",
    "generate": "Сгенерировать"
  },
  "passwordGenerator": {
    "title": "Генератор паролей",
    "description": "Генерируйте случайные сложные пароли в соответствии с вашими потребностями. Все операции выполняются локально в браузере, что гарантирует безопасность и конфиденциальность. Вы можете настроить длину и включить прописные, строчные буквы, цифры и специальные символы.",
    "uppercase": "Прописные",
    "lowercase": "Строчные",
    "number": "Цифры",
    "symbols": "Символы",
    "length": "Длина",
    "generate": "Сгенерировать"
  },
  "hashText": {
    "title": "Хешировать текст",
    "description": "Шифруйте текст с использованием MD5, SHA1, SHA256, SHA224, SHA512, SHA384, SHA3 или RIPEMD160."
  },
  "bcrypt": {
    "title": "Bcrypt",
    "description": "Bcrypt — это адаптивная функция хеширования паролей. Она основана на алгоритме шифрования Blowfish и специально разработана для безопасного хранения паролей.",
    "hash_from": "Ваша строка",
    "salt_count": "Количество соли",
    "compare_title": "Сравнить строку с хешем",
    "compare_from": "Ваша строка",
    "compare_to": "Ваш хеш",
    "match": "Совпадение"
  },
  "encryptDecryptText": {
    "title": "Шифрование/дешифрование текста",
    "description": "Шифруйте и дешифруйте текст с использованием AES, TripleDES, Rabbit или RC4.",
    "encrypt_title": "Зашифровать",
    "decrypt_title": "Дешифровать",
    "text": "Текст",
    "secret_key": "Секретный ключ",
    "algorithm": "Алгоритм",
    "result": "Результат"
  },
  "hmacGenerator": {
    "title": "Генератор Hmac",
    "description": "HMAC (код аутентификации сообщений на основе хеша) — это код аутентификации сообщений, основанный на хеш-функции и секретном ключе, используемый для проверки целостности и подлинности сообщений. HMAC можно использовать с различными хеш-функциями, такими как MD5, SHA-1, SHA-3, SHA-224, SHA-256, SHA-384, SHA-512 и RIPEMD160.",
    "text": "Открытый текст",
    "secret_key": "Секретный ключ",
    "algorithm": "Хеш-функция",
    "output_encode": "Кодировка вывода",
    "output": "HMAC вашего текста"
  },
  "crontabGenerator": {
    "title": "Генератор Crontab",
    "description": "Введите выражение cron и преобразуйте его в человекочитаемый язык с таблицей быстрого доступа к выражениям cron."
  },
  "SQLFormatter": {
    "title": "Форматировщик SQL",
    "description": "Форматируйте неорганизованный SQL для облегчения чтения и понимания. Он также может улучшить SQL перед отправкой кода, что облегчает его поддержку.",
    "from": "SQL-запрос",
    "to": "Отформатированная версия вашего запроса",
    "dialect": "Диалект",
    "keyword_case": "Регистр ключевых слов",
    "indent_style": "Стиль отступов"
  },
  "javascriptMinify": {
    "title": "Минификация JavaScript",
    "description": "Минификация JavaScript-кода означает процесс удаления всех ненужных символов из исходного кода без изменения его функциональности. Эти ненужные символы часто включают пробелы, разрывы строк, комментарии и разделители блоков, которые используются для улучшения читаемости кода, но не требуются для его выполнения.",
    "from": "Ваш код",
    "to": "Минифицированный код"
  },
  "YAMLFormatter": {
    "title": "Форматировщик YAML",
    "description": "Инструмент форматирования YAML может улучшить и выделить конфигурации YAML, улучшая читаемость и упрощая поддержку.",
    "sort_key": "Сортировать ключи",
    "indent_size": "Размер отступа"
  },
  "MACAddressLookup": {
    "title": "Поиск MAC-адреса",
    "description": "Этот инструмент позволяет быстро и легко узнать производителя и поставщика устройства по его MAC-адресу.",
    "mac_address": "MAC-адрес",
    "vendor_info": "Информация о производителе"
  },
  "textDiff": {
    "title": "Сравнение текста",
    "description": "Введите текст в два редактора, и алгоритм сравнения выделит различия, что очень удобно для пользователей, которым необходимо сравнить тексты."
  },
  "xssDefence": {
    "title": "Защита от XSS",
    "description": "Этот инструмент выявляет части вашего кода, которые могут быть уязвимы для XSS-атак, и выделяет их. Это очень полезно и удобно для изучения XSS и защиты от XSS-атак.",
    "remove": "Удалить"
  }
}
