{
  "rsa": {
    "title": "RSA-sleutelpaar generator",
    "description": "Deze tool is een online RSA-sleutelpaar generator die is ontworpen om gebruikers te helpen snel veilige RSA publieke en private sleutels te genereren. RSA (Rivest-Shamir-Adleman) is een veelgebruikte cryptografische algoritme met openbare sleutel, voornamelijk gebruikt voor gegevensversleuteling en digitale handtekeningen."
  },
  "MD5": {
    "title": "MD5 versleuteling",
    "description": "Gebruik MD5 (Message-Digest Algorithm 5) om hash-berekeningen uit te voeren op tekstinhoud."
  },
  "SHA": {
    "title": "SHA versleuteling",
    "description": "Gebruik SHA1, SHA3, SHA224, SHA256, SHA384, SHA512 om hash-berekeningen uit te voeren op tekstinhoud."
  },
  "RIPEMD": {
    "title": "RIPEMD",
    "description": "Een hashfunctie gebaseerd op de MD4-structuur, die een hashwaarde van 160 bits (20 bytes) genereert."
  },
  "AESEncrypt": {
    "title": "AES versleuteling",
    "description": "Gebruik het AES (Advanced Encryption Standard) algoritme om tekst te versleutelen en te ontsleutelen. AES is een symmetrisch versleutelingsalgoritme gebaseerd op substitutie-permutatienetwerken."
  },
  "AESDecrypt": {
    "title": "AES ontsleuteling",
    "description": "Gebruik het AES (Advanced Encryption Standard) algoritme om tekst te versleutelen en te ontsleutelen. AES is een symmetrisch versleutelingsalgoritme gebaseerd op substitutie-permutatienetwerken."
  },
  "base64EncodeDecode": {
    "title": "Base64 coderen/decoderen",
    "description": "De Base64 codeer/decoderingstool wordt gebruikt om binaire gegevens naar een tekststring te coderen of Base64-gecodeerde tekst terug naar binaire gegevens te decoderen, vaak gebruikt voor gegevensoverdracht en -opslag."
  },
  "CSVToJSON": {
    "title": "CSV naar JSON converter",
    "description": "CSV is een eenvoudig tekstbestandsformaat dat vaak wordt gebruikt om tabelgegevens op te slaan. Het bestaat uit waarden gescheiden door komma's, waarbij elke waarde tussen dubbele aanhalingstekens staat en elke regel een record vertegenwoordigt."
  },
  "JSONToCSV": {
    "title": "JSON naar CSV converter",
    "description": "CSV is een eenvoudig tekstbestandsformaat dat vaak wordt gebruikt om tabelgegevens op te slaan. Het bestaat uit waarden gescheiden door komma's, waarbij elke waarde tussen dubbele aanhalingstekens staat en elke regel een record vertegenwoordigt."
  },
  "YAMLToJSON": {
    "title": "YAML naar JSON converter",
    "description": "YAML/JSON conversie is een gebruiksvriendelijke online tool die bestanden van YAML-formaat naar JSON-formaat converteert. Het biedt naadloze conversie tussen JSON en YAML, wat het geschikt maakt voor gebruikers die gegevens moeten beheren, overdragen of valideren."
  },
  "JSONToYAML": {
    "title": "JSON naar YAML converter",
    "description": "YAML/JSON conversie is een gebruiksvriendelijke online tool die bestanden van JSON-formaat naar YAML-formaat converteert. Het biedt naadloze conversie tussen JSON en YAML, wat het geschikt maakt voor gebruikers die gegevens moeten beheren, overdragen of valideren."
  },
  "dateTimeConverter": {
    "title": "Datum-tijd converter",
    "description": "Deze tool maakt eenvoudige conversie tussen verschillende datum- en tijdformaten mogelijk."
  },
  "queryParamsToJSON": {
    "title": "Query Parameters naar JSON converter",
    "description": "Converteer eenvoudig URL-queryparameters naar JSON-indeling, waardoor het voor gebruikers gemakkelijker wordt om ze te bekijken en te gebruiken."
  },
  "envToNetlifyToml": {
    "title": ".env naar netlify.toml converter",
    "description": "Deze tool maakt snelle en eenvoudige conversie van .env-configuratiebestanden naar TOML-configuratiebestanden mogelijk. TOML is ontworpen als een minimaal configuratiebestandsformaat dat gemakkelijk leesbaar is en ondubbelzinnig wordt omgezet naar hashtabellen. TOML kan eenvoudig worden geparseerd naar datastructuren in verschillende programmeertalen."
  },
  "imageToBase64Converter": {
    "title": "Afbeelding naar Base64 converter",
    "description": "De afbeelding naar BASE64-coderingstool stelt je in staat om eenvoudig verschillende afbeeldingsformaten naar Base64 te converteren. Sleep de afbeelding eenvoudig naar het aangegeven gebied om de bewerking te voltooien! De Base64-codering van een afbeelding codeert de afbeeldingsgegevens naar een string, zodat je de string kunt gebruiken in plaats van de afbeeldings-URL."
  },
  "integerBaseConverter": {
    "title": "Geheel getal basisconverter",
    "description": "De basisconversietool stelt gebruikers in staat om gehele getallen tussen verschillende bases te converteren, met ingebouwde ondersteuning voor veelgebruikte bases zoals 2, 8, 10, 16 en 64."
  },
  "colorConverter": {
    "title": "Kleurconverter",
    "description": "De kleurconversietool stelt gebruikers in staat om snel hun kleurwaarden naar andere formaten te converteren en geeft de standaardnaam van de kleur. Ondersteunde formaten zijn onder andere hex, rgb, hsl, hwb, lch en cmyk."
  },
  "caseConverter": {
    "title": "Lettertype converter",
    "description": "De lettertypeconversietool stelt je in staat om tekst snel om te zetten in het gewenste formaat. Het is zeer handig voor het converteren van naamgevingsconventies, titelindelingen, enz. Het bevat hoofdletters, kleine letters, camelCase, titleCase, constantCase, hyphenCase, PascalCase, pathCase en snake_case."
  },
  "textToUnicode": {
    "title": "Tekst naar Unicode converter",
    "description": "De tekst naar Unicode convertertool stelt je in staat om gemakkelijk de Unicode-code van een teken op te zoeken of het teken te vinden dat overeenkomt met een Unicode-code. Het kan tekst in batch converteren naar Unicode-codes of Unicode-codes in batch converteren naar tekst."
  },
  "XMLToJSON": {
    "title": "XML naar JSON converter",
    "description": "Deze tool maakt snelle conversie van XML naar JSON mogelijk. Extensible Markup Language (XML) stelt je in staat om gegevens op een deelbare manier te definiëren en op te slaan. XML ondersteunt de uitwisseling van informatie tussen computersystemen (zoals websites, databases en toepassingen van derden). Vooraf gedefinieerde regels vereenvoudigen het proces van het verzenden van gegevens in XML-formaat via een netwerk, en de ontvanger kan deze regels gebruiken om de gegevens nauwkeurig en efficiënt te lezen."
  },
  "JSONToXML": {
    "title": "JSON naar XML converter",
    "description": "Deze tool maakt snelle conversie van JSON naar XML mogelijk. Extensible Markup Language (XML) stelt je in staat om gegevens op een deelbare manier te definiëren en op te slaan. XML ondersteunt de uitwisseling van informatie tussen computersystemen (zoals websites, databases en toepassingen van derden). Vooraf gedefinieerde regels vereenvoudigen het proces van het verzenden van gegevens in XML-formaat via een netwerk, en de ontvanger kan deze regels gebruiken om de gegevens nauwkeurig en efficiënt te lezen."
  },
  "markdownToHTML": {
    "title": "Markdown naar HTML converter",
    "description": "Deze tool stelt je in staat om je Markdown-inhoud snel om te zetten naar HTML-indeling, en biedt ook de optie om het als een PDF-bestand te downloaden."
  },
  "escapeHTMLEntities": {
    "title": "HTML-entiteiten ontsnappen",
    "description": "Ontsnap HTML-entiteiten zoals <, >, &, \" en ' zodat ze veilig in andere codeformaten kunnen worden ingevoegd, waardoor fouten worden voorkomen."
  },
  "YAMLToTOML": {
    "title": "YAML naar TOML converter",
    "description": "De YAML naar TOML online tool stelt je in staat om eenvoudig YAML-formaat code om te zetten naar TOML-formaat."
  },
  "TOMLToYAML": {
    "title": "TOML naar YAML converter",
    "description": "De TOML naar YAML online tool stelt je in staat om eenvoudig TOML-formaat code om te zetten naar YAML-formaat."
  },
  "JSONToTOML": {
    "title": "JSON naar TOML converter",
    "description": "Deze tool stelt gebruikers in staat om eenvoudig JSON-gegevens om te zetten naar TOML-configuratie, wat handig is voor gebruikers die tussen verschillende configuratiebestandsformaten moeten converteren."
  },
  "TOMLToJSON": {
    "title": "TOML naar JSON converter",
    "description": "Deze tool stelt gebruikers in staat om eenvoudig TOML-configuraties om te zetten naar JSON-indeling, waardoor het handig is voor gebruikers die TOML-configuraties moeten bekijken."
  },
  "JSONFormatter": {
    "title": "JSON Formatter",
    "description": "De JSON-viewer kan je JSON-gegevens verfraaien en biedt handige functies zoals zoeken, inklappen, uitvouwen, pad, vervangen en markeren."
  },
  "URLEncodeDecoder": {
    "title": "URL Encoder/decoder",
    "description": "Om bepaalde speciale tekst in URL's te kunnen gebruiken, kun je deze tool gebruiken om je URL te coderen. Je kunt deze tool ook gebruiken om ontvangen URL's te decoderen."
  },
  "URLParser": {
    "title": "URL parser",
    "description": "Deze tool is ontworpen om gebruikers in staat te stellen om duidelijk en eenvoudig de verschillende componenten van een URL te bekijken, zoals protocol, domein, poort, queryparameters, enz."
  },
  "MIMETypes": {
    "title": "MIME-typen",
    "description": "Deze tool stelt gebruikers in staat om snel tussen bestandstypen en MIME-typen te converteren. Het biedt ook een snelle opzoektafel."
  },
  "basicAuthGenerator": {
    "title": "Basis authenticatie generator",
    "description": "Genereer snel basis authenticatiegegevens door een gebruikersnaam en wachtwoord in te voeren, wat handig is voor het verzenden van verzoeken in tools zoals PostMan."
  },
  "XMLFormatter": {
    "title": "XML formatter",
    "description": "Formatteer en markeer snel XML, wat handig is voor het bekijken van XML-gegevens."
  },
  "JWTParser": {
    "title": "JWT parser",
    "description": "Parseer snel JWT om de Header, Payload en Handtekening te verkrijgen, die kunnen worden gebruikt om JWT-gegevens te extraheren en te verifiëren, wat het handig maakt voor foutopsporing."
  },
  "tokenGenerator": {
    "title": "Token Generator",
    "description": "Genereer willekeurig tokens op basis van de keuze van het type tekens en de lengte door de gebruiker. Het kan hoofdletters, kleine letters, cijfers en speciale symbolen bevatten."
  },
  "passwordGenerator": {
    "title": "Wachtwoord generator",
    "description": "Genereer willekeurige sterke wachtwoorden volgens je behoeften. Alle bewerkingen worden lokaal in de browser uitgevoerd, wat veiligheid en privacy garandeert. Je kunt de lengte aanpassen en hoofdletters, kleine letters, cijfers en speciale symbolen opnemen."
  },
  "hashText": {
    "title": "Hash tekst",
    "description": "Versleutel tekst met behulp van MD5, SHA1, SHA256, SHA224, SHA512, SHA384, SHA3 of RIPEMD160."
  },
  "bcrypt": {
    "title": "Bcrypt",
    "description": "Bcrypt is een adaptieve wachtwoord-hashfunctie. Het is gebaseerd op het Blowfish-versleutelingsalgoritme en is specifiek ontworpen voor veilige wachtwoordopslag."
  },
  "encryptDecryptText": {
    "title": "Versleutel / ontsleutel tekst",
    "description": "Versleutel en ontsleutel tekst met behulp van AES, TripleDES, Rabbit of RC4."
  },
  "hmacGenerator": {
    "title": "Hmac generator",
    "description": "HMAC (Hash-based Message Authentication Code) is een berichtverificatiecode gebaseerd op een hashfunctie en een geheime sleutel, gebruikt om de integriteit en authenticiteit van berichten te verifiëren. HMAC kan worden gebruikt met verschillende hashfuncties zoals MD5, SHA-1, SHA-3, SHA-224, SHA-256, SHA-384, SHA-512 en RIPEMD160."
  },
  "crontabGenerator": {
    "title": "Crontab generator",
    "description": "Voer een cron-expressie in en vertaal deze naar een leesbare taal, met een snelle referentietabel voor cron-expressies."
  },
  "SQLFormatter": {
    "title": "SQL formatter",
    "description": "Formatteer ongeorganiseerde SQL voor eenvoudigere leesbaarheid en begrip. Het kan ook SQL verfraaien voordat code wordt ingediend, waardoor het gemakkelijker te onderhouden is."
  },
  "javascriptMinify": {
    "title": "Javascript minify",
    "description": "JavaScript-code minificatie verwijst naar het proces van het verwijderen van alle onnodige tekens uit de broncode zonder de functionaliteit ervan te wijzigen. Deze onnodige tekens omvatten vaak spaties, regeleinden, opmerkingen en blokafscheiders, die worden gebruikt om de leesbaarheid van de code te verbeteren maar niet nodig zijn voor de uitvoering."
  },
  "YAMLFormatter": {
    "title": "YAML formatter",
    "description": "De YAML-formatteertool kan YAML-configuraties verfraaien en markeren, waardoor de leesbaarheid wordt verbeterd en het onderhoud eenvoudiger wordt."
  },
  "MACAddressLookup": {
    "title": "MAC-adres opzoeken",
    "description": "Deze tool stelt je in staat om snel en eenvoudig de leverancier en fabrikant van een apparaat op te zoeken op basis van het MAC-adres."
  },
  "textDiff": {
    "title": "Tekstverschillen",
    "description": "Voer tekst in twee editors in en het vergelijkingsalgoritme zal de verschillen markeren, wat het zeer handig maakt voor gebruikers die tekst moeten vergelijken."
  },
  "xssDefence": {
    "title": "XSS verdediging",
    "description": "Deze tool identificeert delen van je code die mogelijk kwetsbaar zijn voor XSS-aanvallen en markeert ze. Het is zeer nuttig en handig voor het leren over XSS en het verdedigen tegen XSS-aanvallen."
  }
}
