{
  "category": {
    "favorite": "Favori araçlar",
    "crypto": "Kripto/Kodlama",
    "converter": "Dönüştürücü",
    "web": "Web",
    "development": "Geliştirme",
    "network": "Ağ",
    "text": "Metin",
    "security": "Güvenlik"
  },
  "rsa": {
    "title": "RSA anahtar çifti oluşturucu",
    "description": "Bu araç, kullanıcıların güvenli RSA genel ve özel anahtarlarını hızlı bir şekilde oluşturmasına yardımcı olmak için tasarlanmış çevrimiçi bir RSA anahtar oluşturucusudur. RSA (Rivest-Shamir-Adleman), veri şifreleme ve dijital imzalar için yaygın olarak kullanılan bir açık anahtarlı kriptografi algoritmasıdır.",
    "generate": "Anahtar çifti oluştur",
    "bits": "Bitler",
    "public_key": "Genel anahtar",
    "private_key": "Özel anahtar"
  },
  "MD5": {
    "title": "MD5",
    "description": "MD5 (Mesaj-Özeti Algoritması 5) kullanarak metin içeriği üzerinde hash hesaplamaları yapın.",
    "from": "Metniniz",
    "to": "Sonuç"
  },
  "SHA": {
    "title": "SHA şifreleme",
    "description": "SHA1, SHA3, SHA224, SHA256, SHA384, SHA512 kullanarak metin içeriği üzerinde hash hesaplamaları yapın.",
    "algorithm": "Algoritma",
    "hash_length": "Hash uzunluğu",
    "from": "Metniniz",
    "to": "Sonuç"
  },
  "RIPEMD": {
    "title": "RIPEMD",
    "description": "MD4 yapısına dayalı bir hash fonksiyonu olup, 160-bit (20-bayt) uzunluğunda bir hash değeri üretir.",
    "from": "Metniniz",
    "to": "Sonuç"
  },
  "AESEncrypt": {
    "title": "AES şifreleme",
    "description": "AES (Gelişmiş Şifreleme Standardı) algoritmasını kullanarak metni şifreleyin ve çözün. AES, yerine geçirme-permutasyon ağlarına dayalı simetrik bir şifreleme algoritmasıdır.",
    "tag_length": "Etiket uzunluğu",
    "additional_data": "Ek veri",
    "from": "Metniniz",
    "to": "Şifrelenmiş metin"
  },
  "AESDecrypt": {
    "title": "AES şifre çözme",
    "description": "AES (Gelişmiş Şifreleme Standardı) algoritmasını kullanarak metni şifreleyin ve çözün. AES, yerine geçirme-permutasyon ağlarına dayalı simetrik bir şifreleme algoritmasıdır.",
    "tag_length": "Etiket uzunluğu",
    "additional_data": "Ek veri",
    "from": "Şifrelenmiş metin",
    "to": "Çözülen metin"
  },
  "base64EncodeDecode": {
    "title": "Base64 Kodlama/Çözme",
    "description": "Base64 kodlama/çözme aracı, ikili verileri bir metin dizisine kodlamak veya Base64 ile kodlanmış metni tekrar ikili verilere çözmek için kullanılır. Genellikle veri iletimi ve depolama için kullanılır.",
    "encode_title": "Base64'e kodla",
    "decode_title": "Base64'ten çöz",
    "encode_from": "Metniniz",
    "encode_to": "Kodlanmış metin",
    "decode_from": "Base64 metniniz",
    "decode_to": "Çözülen metin"
  },
  "CSVToJSON": {
    "title": "CSV'den JSON'a dönüştürücü",
    "description": "CSV, genellikle tablo verilerini depolamak için kullanılan bir düz metin dosya formatıdır. Virgülle ayrılmış değerlerden oluşur, her değer çift tırnak içinde yer alır ve her satır bir kaydı temsil eder.",
    "lowercase": "küçük harf anahtarlar"
  },
  "JSONToCSV": {
    "title": "JSON'dan CSV'ye dönüştürücü",
    "description": "CSV, genellikle tablo verilerini depolamak için kullanılan bir düz metin dosya formatıdır. Virgülle ayrılmış değerlerden oluşur, her değer çift tırnak içinde yer alır ve her satır bir kaydı temsil eder."
  },
  "YAMLToJSON": {
    "title": "YAML'den JSON'a dönüştürücü",
    "description": "YAML/JSON dönüştürme, YAML formatındaki dosyaları JSON formatına dönüştüren kullanımı kolay bir çevrimiçi araçtır. JSON ve YAML arasında sorunsuz dönüşüm sağlar ve veri işleme, aktarımı veya doğrulama işlemleri için uygundur."
  },
  "JSONToYAML": {
    "title": "JSON'dan YAML'a dönüştürücü",
    "description": "YAML/JSON dönüştürme, JSON formatındaki dosyaları YAML formatına dönüştüren kullanımı kolay bir çevrimiçi araçtır. JSON ve YAML arasında sorunsuz dönüşüm sağlar ve veri işleme, aktarımı veya doğrulama işlemleri için uygundur."
  },
  "dateTimeConverter": {
    "title": "Tarih-saat dönüştürücü",
    "description": "Bu araç, çeşitli tarih ve saat formatları arasında kolay dönüşüm yapmanızı sağlar."
  },
  "queryParamsToJSON": {
    "title": "Sorgu Parametrelerini JSON'a dönüştürücü",
    "description": "URL sorgu parametrelerini JSON formatına kolayca dönüştürün, böylece kullanıcıların bunları görmesi ve kullanması daha kolay hale gelir."
  },
  "envToNetlifyToml": {
    "title": ".env'den netlify.toml'a dönüştürücü",
    "description": ".env yapılandırma dosyalarını TOML yapılandırma dosyalarına hızlı ve kolay bir şekilde dönüştürmenizi sağlar. TOML, okunması kolay ve karma tablolarına açıkça eşlenen minimal bir yapılandırma dosyası formatı olarak tasarlanmıştır. TOML, çeşitli dillerdeki veri yapılarıyla kolayca ayrıştırılabilir."
  },
  "imageToBase64Converter": {
    "title": "Görüntüyü Base64'e dönüştürücü",
    "description": "Görüntüyü Base64'e kodlama aracı, çeşitli görüntü formatlarını kolayca Base64'e dönüştürmenizi sağlar. Görüntüyü belirtilen alana sürükleyin ve işlemi tamamlayın! Bir görüntünün Base64 kodlaması, görüntü verilerini bir diziye kodlar, böylece görüntü URL'si yerine bu diziyi kullanabilirsiniz.",
    "image": "Görüntü",
    "output": "Base64 Çıkışı",
    "img_tag": "<img> etiketinde kullan",
    "css": "CSS'te kullan"
  },
  "integerBaseConverter": {
    "title": "Tam sayı tabanı dönüştürücü",
    "description": "Taban dönüştürme aracı, kullanıcıların tam sayıları herhangi bir taban arasında dönüştürmesini sağlar ve 2, 8, 10, 16 ve 64 gibi yaygın kullanılan tabanlar için yerleşik destek sunar.",
    "input": "Girdi sayısı",
    "input_base": "Girdi tabanı"
  },
  "colorConverter": {
    "title": "Renk dönüştürücü",
    "description": "Renk dönüştürme aracı, kullanıcıların renk değerlerini diğer formatlara hızla dönüştürmelerini sağlar ve rengin standart adını verir. Desteklenen formatlar arasında hex, rgb, hsl, hwb, lch ve cmyk bulunur."
  },
  "caseConverter": {
    "title": "Büyük/küçük harf dönüştürücü",
    "description": "Büyük/küçük harf dönüştürme aracı, metni istediğiniz formata hızlıca dönüştürmenizi sağlar. Adlandırma kurallarını, başlık formatlarını vb. dönüştürmek için çok kullanışlıdır. Büyük harf, küçük harf, camelCase, titleCase, constantCase, hyphenCase, PascalCase, pathCase ve snake_case gibi formatları içerir.",
    "Lowercase": "Küçük harf",
    "Uppercase": "Büyük harf",
    "Camelcase": "Camelcase",
    "Capitalcase": "Capitalcase",
    "Constantcase": "Constantcase",
    "Dotcase": "Dotcase",
    "Pascalcase": "Pascalcase",
    "PascalSnakeCase": "PascalSnakeCase",
    "Nocase": "Nocase",
    "KebabCase": "KebabCase",
    "Pathcase": "Pathcase",
    "Sentencecase": "Sentencecase",
    "Snakecase": "Snakecase",
    "Mockingcase": "Mockingcase",
    "TrainCase": "TrainCase"
  },
  "textToUnicode": {
    "title": "Metni unicode'a dönüştürücü",
    "description": "Metni Unicode'a dönüştürme aracı, bir karakterin Unicode kodunu kolayca bulmanızı veya bir Unicode koduna karşılık gelen karakteri bulmanızı sağlar. Metni toplu olarak Unicode kodlarına veya Unicode kodlarını toplu olarak metne dönüştürebilir.",
    "encode_title": "Metni Unicode'a dönüştür",
    "decode_title": "Unicode'u Metne dönüştür",
    "encode_from": "Unicode'a dönüştürmek için metin girin",
    "encode_to": "Metninizden Unicode",
    "decode_from": "Metne dönüştürmek için Unicode girin",
    "decode_to": "Unicode'unuzdan metin"
  },
  "XMLToJSON": {
    "title": "XML'den JSON'a dönüştürücü",
    "description": "Bu araç, XML'i JSON'a hızlı bir şekilde dönüştürmenizi sağlar. Genişletilebilir Biçimlendirme Dili (XML), verilerin paylaşılabilir bir şekilde tanımlanmasını ve saklanmasını sağlar. XML, bilgisayar sistemleri (web siteleri, veritabanları ve üçüncü taraf uygulamalar gibi) arasında bilgi alışverişini destekler. Önceden tanımlanmış kurallar, XML formatındaki verilerin herhangi bir ağ üzerinden iletilmesini basitleştirir ve alıcı bu kuralları kullanarak verileri doğru ve verimli bir şekilde okuyabilir."
  },
  "JSONToXML": {
    "title": "JSON'dan XML'e dönüştürücü",
    "description": "Bu araç, JSON'u XML'e hızlı bir şekilde dönüştürmenizi sağlar. Genişletilebilir Biçimlendirme Dili (XML), verilerin paylaşılabilir bir şekilde tanımlanmasını ve saklanmasını sağlar. XML, bilgisayar sistemleri (web siteleri, veritabanları ve üçüncü taraf uygulamalar gibi) arasında bilgi alışverişini destekler. Önceden tanımlanmış kurallar, XML formatındaki verilerin herhangi bir ağ üzerinden iletilmesini basitleştirir ve alıcı bu kuralları kullanarak verileri doğru ve verimli bir şekilde okuyabilir."
  },
  "markdownToHTML": {
    "title": "Markdown'dan HTML'e dönüştürücü",
    "description": "Bu araç, Markdown içeriğinizi hızlı bir şekilde HTML formatına dönüştürmenizi sağlar ve ayrıca PDF dosyası olarak indirme seçeneği sunar."
  },
  "escapeHTMLEntities": {
    "title": "HTML varlıklarını kaçır",
    "description": "<, >, &, \" ve ' gibi HTML varlıklarını kaçırarak bunların diğer kod formatlarına güvenli bir şekilde eklenmesini sağlayın, böylece hataların önüne geçin.",
    "escape_title": "HTML varlıklarını kaçır",
    "unescape_title": "HTML varlıklarını çöz",
    "escape_from": "Metniniz",
    "escape_to": "Kaçırılmış metniniz",
    "unescape_from": "Kaçırılmış metniniz",
    "unescape_to": "Çözülmüş metniniz"
  },
  "YAMLToTOML": {
    "title": "YAML'den TOML'a dönüştürücü",
    "description": "YAML'i TOML formatına kolayca dönüştürmenizi sağlayan çevrimiçi araç."
  },
  "TOMLToYAML": {
    "title": "TOML'dan YAML'a dönüştürücü",
    "description": "TOML'i YAML formatına kolayca dönüştürmenizi sağlayan çevrimiçi araç."
  },
  "JSONToTOML": {
    "title": "JSON'dan TOML'a dönüştürücü",
    "description": "Bu araç, kullanıcıların JSON verilerini TOML yapılandırmasına kolayca dönüştürmesini sağlar. Farklı yapılandırma dosyası formatları arasında dönüştürme ihtiyacı olan kullanıcılar için kullanışlıdır."
  },
  "TOMLToJSON": {
    "title": "TOML'dan JSON'a dönüştürücü",
    "description": "Bu araç, kullanıcıların TOML yapılandırmalarını JSON formatına kolayca dönüştürmesini sağlar, TOML yapılandırmalarını görüntülemek isteyen kullanıcılar için uygundur."
  },
  "JSONFormatter": {
    "title": "JSON Biçimlendirici",
    "description": "JSON görüntüleyici, JSON verilerinizi güzelleştirebilir ve arama, daraltma, genişletme, yol, değiştirme ve vurgulama gibi faydalı özellikler sunar."
  },
  "URLEncodeDecoder": {
    "title": "URL Kodlayıcı/Çözücü",
    "description": "Belirli özel metinlerin URL'lerde kullanılmasına izin vermek için bu aracı kullanarak URL'nizi kodlayabilirsiniz. Ayrıca aldığınız URL'leri çözmek için de bu aracı kullanabilirsiniz.",
    "encode_title": "URL kodlayıcı",
    "decode_title": "URL çözücü"
  },
  "URLParser": {
    "title": "URL ayrıştırıcı",
    "description": "Bu araç, kullanıcıların bir URL'nin protokol, alan adı, port, sorgu parametreleri gibi çeşitli bileşenlerini açık ve kolay bir şekilde görüntülemesini sağlamak için tasarlanmıştır.",
    "your_url": "Ayrıştırılacak URL'niz"
  },
  "MIMETypes": {
    "title": "MIME türleri",
    "description": "Bu araç, kullanıcıların dosya türleri ve MIME türleri arasında hızlı bir şekilde dönüştürme yapmasını sağlar. Ayrıca hızlı bir arama tablosu sunar.",
    "mime_to_extension": "MIME türünden uzantıya",
    "mime_to_extension_desc": "Bir MIME türüyle ilişkili dosya uzantılarını öğrenin",
    "extension_to_mime": "Dosya uzantısından MIME türüne",
    "extension_to_mime_desc": "Bir dosya uzantısıyla ilişkili MIME türünü öğrenin"
  },
  "basicAuthGenerator": {
    "title": "Temel kimlik doğrulama oluşturucu",
    "description": "Kullanıcı adı ve şifre girerek temel kimlik doğrulama kimlik bilgilerini hızlıca oluşturun, bu da PostMan gibi araçlarla istek gönderirken kullanışlıdır."
  },
  "XMLFormatter": {
    "title": "XML biçimlendirici",
    "description": "XML'i hızlıca biçimlendirin ve vurgulayın, böylece XML verilerini görüntülemek için kullanışlı hale gelir.",
    "indent": "Girinti boyutu",
    "collapse": "İçeriği daralt"
  },
  "JWTParser": {
    "title": "JWT ayrıştırıcı",
    "description": "JWT'yi hızlı bir şekilde ayrıştırarak Başlık, Yük ve İmza bilgilerini elde edin. Bu, JWT verilerini çıkarmak ve doğrulamak için kullanılabilir, hata ayıklama için faydalıdır.",
    "uppercase": "Büyük harf",
    "lowercase": "Küçük harf",
    "number": "Sayılar",
    "symbols": "Semboller",
    "length": "Uzunluk",
    "generate": "Oluştur"
  },
  "tokenGenerator": {
    "title": "Token oluşturucu",
    "description": "Kullanıcının seçtiği karakter türlerine ve uzunluğa bağlı olarak rastgele tokenlar oluşturun. Büyük harf, küçük harf, sayılar ve özel semboller içerebilir.",
    "uppercase": "Büyük harf",
    "lowercase": "Küçük harf",
    "number": "Sayılar",
    "symbols": "Semboller",
    "length": "Uzunluk",
    "generate": "Oluştur"
  },
  "passwordGenerator": {
    "title": "Şifre oluşturucu",
    "description": "İhtiyaçlarınıza göre rastgele güçlü şifreler oluşturun. Tüm işlemler tarayıcıda yerel olarak gerçekleştirilir, bu da güvenlik ve gizliliği sağlar. Uzunluğu özelleştirebilir ve büyük harf, küçük harf, sayılar ve özel semboller ekleyebilirsiniz.",
    "uppercase": "Büyük harf",
    "lowercase": "Küçük harf",
    "number": "Sayılar",
    "symbols": "Semboller",
    "length": "Uzunluk",
    "generate": "Oluştur"
  },
  "hashText": {
    "title": "Metni hash yap",
    "description": "MD5, SHA1, SHA256, SHA224, SHA512, SHA384, SHA3 veya RIPEMD160 kullanarak metni şifreleyin."
  },
  "bcrypt": {
    "title": "Bcrypt",
    "description": "Bcrypt, uyarlanabilir bir şifre hashleme fonksiyonudur. Blowfish şifreleme algoritmasına dayanır ve güvenli şifre saklama için özel olarak tasarlanmıştır.",
    "hash_from": "Metniniz",
    "salt_count": "Salt sayısı",
    "compare_title": "Metni hash ile karşılaştır",
    "compare_from": "Metniniz",
    "compare_to": "Hash'iniz",
    "match": "Eşleşme"
  },
  "encryptDecryptText": {
    "title": "Metni şifrele / şifreyi çöz",
    "description": "AES, TripleDES, Rabbit veya RC4 kullanarak metni şifreleyin ve şifresini çözün.",
    "encrypt_title": "Şifrele",
    "decrypt_title": "Şifreyi çöz",
    "text": "Metin",
    "secret_key": "Gizli anahtar",
    "algorithm": "Algoritma",
    "result": "Sonuç"
  },
  "hmacGenerator": {
    "title": "Hmac oluşturucu",
    "description": "HMAC (Hash Tabanlı Mesaj Doğrulama Kodu), bir hash fonksiyonuna ve gizli bir anahtara dayalı mesaj doğrulama kodudur, mesajların bütünlüğünü ve kimliğini doğrulamak için kullanılır. HMAC, MD5, SHA-1, SHA-3, SHA-224, SHA-256, SHA-384, SHA-512 ve RIPEMD160 gibi çeşitli hash fonksiyonlarıyla kullanılabilir.",
    "text": "Düz metin",
    "secret_key": "Gizli anahtar",
    "algorithm": "Hash fonksiyonu",
    "output_encode": "Çıktı kodlaması",
    "output": "Metninizin HMAC'i"
  },
  "crontabGenerator": {
    "title": "Crontab oluşturucu",
    "description": "Bir cron ifadesi girin ve bunu insan tarafından okunabilir bir dile çevirin, ayrıca cron ifadeleri için hızlı bir referans tablosu sunar."
  },
  "SQLFormatter": {
    "title": "SQL biçimlendirici",
    "description": "Dağınık SQL'i daha kolay okunabilir ve anlaşılır hale getirin. Ayrıca kod gönderiminden önce SQL'i güzelleştirerek bakımı kolaylaştırır.",
    "from": "SQL sorgusu",
    "to": "Sorgunuzun güzelleştirilmiş hali",
    "dialect": "Diyalekt",
    "keyword_case": "Anahtar kelime büyük/küçük harf",
    "indent_style": "Girinti stili"
  },
  "javascriptMinify": {
    "title": "Javascript küçült",
    "description": "JavaScript kod küçültme, işlevselliğini değiştirmeden kaynak kodundan tüm gereksiz karakterlerin kaldırılması işlemidir. Bu gereksiz karakterler genellikle boşluklar, satır sonları, yorumlar ve blok ayraçlarıdır; bunlar kodun okunabilirliğini artırmak için kullanılır, ancak yürütme için gerekli değildir.",
    "from": "Kodunuz",
    "to": "Küçültülmüş kod"
  },
  "YAMLFormatter": {
    "title": "YAML biçimlendirici",
    "description": "YAML yapılandırmalarını güzelleştiren ve vurgulayan araç, okunabilirliği artırır ve bakımı kolaylaştırır.",
    "sort_key": "Anahtarları sırala",
    "indent_size": "Girinti boyutu"
  },
  "MACAddressLookup": {
    "title": "MAC adresi sorgulama",
    "description": "Bu araç, bir cihazın MAC adresine göre satıcı ve üretici bilgisini hızlı ve kolay bir şekilde bulmanızı sağlar.",
    "mac_address": "MAC adresi",
    "vendor_info": "Satıcı bilgisi"
  },
  "textDiff": {
    "title": "Metin farkı",
    "description": "İki editöre metin girin ve karşılaştırma algoritması farklılıkları vurgulayacaktır, bu da metin karşılaştırması yapması gereken kullanıcılar için çok kullanışlıdır."
  },
  "xssDefence": {
    "title": "Xss savunması",
    "description": "Bu araç, kodunuzun XSS saldırılarına karşı savunmasız olabilecek kısımlarını tespit eder ve vurgular. XSS hakkında bilgi edinmek ve XSS saldırılarına karşı savunma yapmak için çok faydalıdır.",
    "remove": "Kaldır"
  }
}
