{
  "category": {
    "favorite": "Ferramentas favoritas",
    "crypto": "Criptografia/Codificação",
    "converter": "Conversor",
    "web": "Web",
    "development": "Desenvolvimento",
    "network": "Rede",
    "text": "Texto",
    "security": "Segurança"
  },
  "rsa": {
    "title": "Gerador de par de chaves RSA",
    "description": "Esta ferramenta é um gerador de chaves RSA online projetado para ajudar os usuários a gerar rapidamente chaves públicas e privadas RSA seguras. RSA (Rivest-Shamir-Adleman) é um algoritmo criptográfico de chave pública amplamente utilizado, principalmente para criptografia de dados e assinaturas digitais.",
    "generate": "Gerar par de chaves",
    "bits": "Bits",
    "public_key": "Chave pública",
    "private_key": "Chave privada"
  },
  "MD5": {
    "title": "MD5",
    "description": "Use o MD5 (Message-Digest Algorithm 5) para realizar cálculos de hash no conteúdo do texto.",
    "from": "Sua string",
    "to": "Resultado"
  },
  "SHA": {
    "title": "Criptografia SHA",
    "description": "Use SHA1, SHA3, SHA224, SHA256, SHA384, SHA512 para realizar cálculos de hash no conteúdo do texto.",
    "algorithm": "Algoritmo",
    "hash_length": "Comprimento do hash",
    "from": "Sua string",
    "to": "Resultado"
  },
  "RIPEMD": {
    "title": "RIPEMD",
    "description": "Uma função de hash baseada na estrutura MD4, gerando um valor de hash de 160 bits (20 bytes).",
    "from": "Sua string",
    "to": "Resultado"
  },
  "AESEncrypt": {
    "title": "Criptografia AES",
    "description": "Use o algoritmo AES (Advanced Encryption Standard) para criptografar e descriptografar textos. AES é um algoritmo de criptografia simétrica baseado em redes de substituição-permutação.",
    "tag_length": "Comprimento da tag",
    "additional_data": "Dados adicionais",
    "from": "Sua string",
    "to": "String criptografada"
  },
  "AESDecrypt": {
    "title": "Descriptografia AES",
    "description": "Use o algoritmo AES (Advanced Encryption Standard) para criptografar e descriptografar textos. AES é um algoritmo de criptografia simétrica baseado em redes de substituição-permutação.",
    "tag_length": "Comprimento da tag",
    "additional_data": "Dados adicionais",
    "from": "String criptografada",
    "to": "String descriptografada"
  },
  "base64EncodeDecode": {
    "title": "Codificar/Decodificar Base64",
    "description": "A ferramenta de codificação/decodificação Base64 é usada para codificar dados binários em uma string de texto ou decodificar o texto codificado em Base64 de volta para dados binários, comumente usada para transmissão e armazenamento de dados.",
    "encode_title": "Para base64",
    "decode_title": "De base64",
    "encode_from": "Sua string",
    "encode_to": "String codificada",
    "decode_from": "Sua string base64",
    "decode_to": "String decodificada"
  },
  "CSVToJSON": {
    "title": "Conversor de CSV para JSON",
    "description": "CSV é um formato de arquivo de texto simples, comumente usado para armazenar dados tabulares. Consiste em valores separados por vírgulas, com cada valor entre aspas duplas e cada linha representando um registro.",
    "lowercase": "chaves em minúsculas"
  },
  "JSONToCSV": {
    "title": "Conversor de JSON para CSV",
    "description": "CSV é um formato de arquivo de texto simples, comumente usado para armazenar dados tabulares. Consiste em valores separados por vírgulas, com cada valor entre aspas duplas e cada linha representando um registro."
  },
  "YAMLToJSON": {
    "title": "Conversor de YAML para JSON",
    "description": "A conversão YAML/JSON é uma ferramenta online fácil de usar que converte arquivos do formato YAML para o formato JSON. Permite uma conversão perfeita entre JSON e YAML, tornando-se adequada para usuários que precisam manipular, transferir ou validar dados."
  },
  "JSONToYAML": {
    "title": "Conversor de JSON para YAML",
    "description": "A conversão YAML/JSON é uma ferramenta online fácil de usar que converte arquivos do formato JSON para o formato YAML. Permite uma conversão perfeita entre JSON e YAML, tornando-se adequada para usuários que precisam manipular, transferir ou validar dados."
  },
  "dateTimeConverter": {
    "title": "Conversor de Data-Hora",
    "description": "Esta ferramenta permite uma conversão fácil entre vários formatos de data e hora."
  },
  "queryParamsToJSON": {
    "title": "Conversor de Parâmetros de Consulta para JSON",
    "description": "Converta convenientemente parâmetros de consulta de URL para o formato JSON, facilitando a visualização e o uso pelos usuários."
  },
  "envToNetlifyToml": {
    "title": "Conversor de .env para netlify.toml",
    "description": "Esta ferramenta permite a conversão rápida e fácil de arquivos de configuração .env em arquivos de configuração TOML. TOML foi projetado para ser um formato de arquivo de configuração mínimo, fácil de ler e que mapeia inequivocamente para tabelas de hash. TOML pode ser facilmente analisado em estruturas de dados em várias linguagens."
  },
  "imageToBase64Converter": {
    "title": "Conversor de Imagem para Base64",
    "description": "A ferramenta de codificação de imagem para Base64 permite converter facilmente vários formatos de imagem em Base64. Basta arrastar a imagem para a área designada para concluir a operação! A codificação Base64 de uma imagem codifica os dados da imagem em uma string, permitindo que você use a string em vez do URL da imagem.",
    "image": "Imagem",
    "output": "Saída Base64",
    "img_tag": "Usar na tag <img>",
    "css": "Usar no CSS"
  },
  "integerBaseConverter": {
    "title": "Conversor de base de inteiros",
    "description": "A ferramenta de conversão de base permite que os usuários convertam números inteiros entre qualquer base, com suporte embutido para bases comumente usadas, como 2, 8, 10, 16 e 64.",
    "input": "Número de entrada",
    "input_base": "Base de entrada"
  },
  "colorConverter": {
    "title": "Conversor de cores",
    "description": "A ferramenta de conversão de cores permite que os usuários convertam rapidamente seus valores de cores para outros formatos e fornece o nome padrão da cor. Os formatos suportados incluem hex, rgb, hsl, hwb, lch e cmyk."
  },
  "caseConverter": {
    "title": "Conversor de maiúsculas e minúsculas",
    "description": "A ferramenta de conversão de maiúsculas e minúsculas permite converter rapidamente o texto no formato desejado. É muito conveniente para converter convenções de nomenclatura, formatos de títulos, etc. Inclui maiúsculas, minúsculas, camelCase, titleCase, constantCase, hyphenCase, PascalCase, pathCase e snake_case.",
    "Lowercase": "Minúsculas",
    "Uppercase": "Maiúsculas",
    "Camelcase": "CamelCase",
    "Capitalcase": "CapitalCase",
    "Constantcase": "ConstantCase",
    "Dotcase": "DotCase",
    "Pascalcase": "PascalCase",
    "PascalSnakeCase": "PascalSnakeCase",
    "Nocase": "NoCase",
    "KebabCase": "KebabCase",
    "Pathcase": "PathCase",
    "Sentencecase": "SentenceCase",
    "Snakecase": "SnakeCase",
    "Mockingcase": "MockingCase",
    "TrainCase": "TrainCase"
  },
  "textToUnicode": {
    "title": "Conversor de texto para Unicode",
    "description": "A ferramenta de conversão de texto para Unicode permite que você pesquise facilmente o código Unicode de um caractere ou encontre o caractere correspondente a um código Unicode. Pode converter em lote texto para códigos Unicode ou converter em lote códigos Unicode para texto.",
    "encode_title": "Texto para Unicode",
    "decode_title": "Unicode para Texto",
    "encode_from": "Insira o texto para converter em unicode",
    "encode_to": "Unicode do seu texto",
    "decode_from": "Insira o unicode para converter em texto",
    "decode_to": "Texto do seu Unicode"
  },
  "XMLToJSON": {
    "title": "Conversor de XML para JSON",
    "description": "Esta ferramenta permite a conversão rápida de XML para JSON. A Linguagem de Marcação Extensível (XML) permite que você defina e armazene dados de maneira compartilhável. O XML suporta a troca de informações entre sistemas de computador (como sites, bancos de dados e aplicativos de terceiros). Regras predefinidas simplificam o processo de transmissão de dados no formato XML por qualquer rede, e o destinatário pode usar essas regras para ler os dados de maneira precisa e eficiente."
  },
  "JSONToXML": {
    "title": "Conversor de JSON para XML",
    "description": "Esta ferramenta permite a conversão rápida de JSON para XML. A Linguagem de Marcação Extensível (XML) permite que você defina e armazene dados de maneira compartilhável. O XML suporta a troca de informações entre sistemas de computador (como sites, bancos de dados e aplicativos de terceiros). Regras predefinidas simplificam o processo de transmissão de dados no formato XML por qualquer rede, e o destinatário pode usar essas regras para ler os dados de maneira precisa e eficiente."
  },
  "markdownToHTML": {
    "title": "Conversor de Markdown para HTML",
    "description": "Esta ferramenta permite que você converta rapidamente seu conteúdo Markdown para o formato HTML, e também oferece a opção de baixá-lo como um arquivo PDF."
  },
  "escapeHTMLEntities": {
    "title": "Escape de entidades HTML",
    "description": "Escape de entidades HTML como <, >, &, \" e ' para permitir que sejam inseridas com segurança em outros formatos de código, evitando erros.",
    "escape_title": "Escape de entidades HTML",
    "unescape_title": "Desfazer escape de entidades HTML",
    "escape_from": "Sua string",
    "escape_to": "Sua string com escape",
    "unescape_from": "Sua string com escape",
    "unescape_to": "Sua string sem escape"
  },
  "YAMLToTOML": {
    "title": "Conversor de YAML para TOML",
    "description": "A ferramenta online de YAML para TOML permite converter facilmente o código no formato YAML para o formato TOML."
  },
  "TOMLToYAML": {
    "title": "Conversor de TOML para YAML",
    "description": "A ferramenta online de TOML para YAML permite converter facilmente o código no formato TOML para o formato YAML."
  },
  "JSONToTOML": {
    "title": "Conversor de JSON para TOML",
    "description": "Esta ferramenta permite que os usuários convertam facilmente dados JSON em configuração TOML, o que é útil para usuários que precisam converter entre diferentes formatos de arquivos de configuração."
  },
  "TOMLToJSON": {
    "title": "Conversor de TOML para JSON",
    "description": "Esta ferramenta permite que os usuários convertam facilmente configurações TOML para o formato JSON, tornando conveniente para os usuários que precisam visualizar configurações TOML."
  },
  "JSONFormatter": {
    "title": "Formatador de JSON",
    "description": "O visualizador de JSON pode embelezar seus dados JSON e fornece recursos úteis, como pesquisa, colapso, expansão, caminho, substituição e destaque."
  },
  "URLEncodeDecoder": {
    "title": "Codificador/Decodificador de URL",
    "description": "Para permitir que determinados textos especiais sejam usados em URLs, você pode usar esta ferramenta para codificar seu URL. Você também pode usar esta ferramenta para decodificar URLs que você recebe.",
    "encode_title": "Codificador de URL",
    "decode_title": "Decodificador de URL"
  },
  "URLParser": {
    "title": "Analisador de URL",
    "description": "Esta ferramenta foi projetada para permitir que os usuários visualizem de forma clara e fácil os vários componentes de um URL, como protocolo, domínio, porta, parâmetros de consulta, etc.",
    "your_url": "Seu URL para analisar"
  },
  "MIMETypes": {
    "title": "Tipos MIME",
    "description": "Esta ferramenta permite que os usuários convertam rapidamente entre tipos de arquivos e tipos MIME. Também fornece uma tabela de consulta rápida.",
    "mime_to_extension": "Tipo MIME para extensão",
    "mime_to_extension_desc": "Saiba quais extensões de arquivo estão associadas a um tipo MIME",
    "extension_to_mime": "Extensão de arquivo para tipo MIME",
    "extension_to_mime_desc": "Saiba qual tipo MIME está associado a uma extensão de arquivo"
  },
  "basicAuthGenerator": {
    "title": "Gerador de autenticação básica",
    "description": "Gere rapidamente credenciais de autenticação básica inserindo um nome de usuário e uma senha, facilitando o envio de solicitações em ferramentas como o PostMan."
  },
  "XMLFormatter": {
    "title": "Formatador de XML",
    "description": "Formate e destaque rapidamente o XML, tornando útil a visualização de dados XML.",
    "indent": "Tamanho da indentação",
    "collapse": "Colapsar conteúdo"
  },
  "JWTParser": {
    "title": "Analisador de JWT",
    "description": "Analise rapidamente o JWT para obter o Cabeçalho, o Payload e a Assinatura, que podem ser usados para extrair e verificar dados JWT, tornando-o útil para depuração.",
    "uppercase": "Maiúsculas",
    "lowercase": "Minúsculas",
    "number": "Números",
    "symbols": "Símbolos",
    "length": "Comprimento",
    "generate": "Gerar"
  },
  "tokenGenerator": {
    "title": "Gerador de Token",
    "description": "Gere tokens aleatoriamente com base na escolha do usuário de tipos de caracteres e comprimento. Pode incluir maiúsculas, minúsculas, números e símbolos especiais.",
    "uppercase": "Maiúsculas",
    "lowercase": "Minúsculas",
    "number": "Números",
    "symbols": "Símbolos",
    "length": "Comprimento",
    "generate": "Gerar"
  },
  "passwordGenerator": {
    "title": "Gerador de Senhas",
    "description": "Gere senhas fortes aleatórias de acordo com suas necessidades. Todas as operações são realizadas localmente no navegador, garantindo segurança e privacidade. Você pode personalizar o comprimento e incluir maiúsculas, minúsculas, números e símbolos especiais.",
    "uppercase": "Maiúsculas",
    "lowercase": "Minúsculas",
    "number": "Números",
    "symbols": "Símbolos",
    "length": "Comprimento",
    "generate": "Gerar"
  },
  "hashText": {
    "title": "Texto Hash",
    "description": "Criptografe texto usando MD5, SHA1, SHA256, SHA224, SHA512, SHA384, SHA3 ou RIPEMD160."
  },
  "bcrypt": {
    "title": "Bcrypt",
    "description": "Bcrypt é uma função de hash de senha adaptativa. É baseado no algoritmo de criptografia Blowfish e foi projetado especificamente para armazenamento seguro de senhas.",
    "hash_from": "Sua string",
    "salt_count": "Contagem de salt",
    "compare_title": "Compare string com hash",
    "compare_from": "Sua string",
    "compare_to": "Seu Hash",
    "match": "Corresponder"
  },
  "encryptDecryptText": {
    "title": "Criptografar/Descriptografar texto",
    "description": "Criptografe e descriptografe texto usando AES, TripleDES, Rabbit ou RC4.",
    "encrypt_title": "Criptografar",
    "decrypt_title": "Descriptografar",
    "text": "Texto",
    "secret_key": "Chave secreta",
    "algorithm": "Algoritmo",
    "result": "Resultado"
  },
  "hmacGenerator": {
    "title": "Gerador de HMAC",
    "description": "HMAC (Código de Autenticação de Mensagem baseado em Hash) é um código de autenticação de mensagem baseado em uma função de hash e uma chave secreta, usado para verificar a integridade e autenticidade das mensagens. HMAC pode ser usado com várias funções de hash, como MD5, SHA-1, SHA-3, SHA-224, SHA-256, SHA-384, SHA-512 e RIPEMD160.",
    "text": "Texto simples",
    "secret_key": "Chave secreta",
    "algorithm": "Função de hash",
    "output_encode": "Codificação de saída",
    "output": "HMAC do seu texto"
  },
  "crontabGenerator": {
    "title": "Gerador de Crontab",
    "description": "Insira uma expressão cron e traduza-a para uma linguagem compreensível por humanos, com uma tabela de referência rápida para expressões cron."
  },
  "SQLFormatter": {
    "title": "Formatador de SQL",
    "description": "Formate SQL desorganizado para facilitar a leitura e compreensão. Também pode embelezar o SQL antes da submissão do código, tornando-o mais fácil de manter.",
    "from": "Consulta SQL",
    "to": "Versão embelezada da sua consulta",
    "dialect": "Dialeto",
    "keyword_case": "Maiúsculas/minúsculas de palavras-chave",
    "indent_style": "Estilo de indentação"
  },
  "javascriptMinify": {
    "title": "Minificação de Javascript",
    "description": "A minificação de código JavaScript refere-se ao processo de remover todos os caracteres desnecessários do código-fonte sem alterar sua funcionalidade. Esses caracteres desnecessários geralmente incluem espaços em branco, quebras de linha, comentários e delimitadores de bloco, que são usados para melhorar a legibilidade do código, mas não são necessários para a execução.",
    "from": "Seu código",
    "to": "Código minificado"
  },
  "YAMLFormatter": {
    "title": "Formatador de YAML",
    "description": "A ferramenta de formatação YAML pode embelezar e destacar configurações YAML, melhorando a legibilidade e facilitando a manutenção.",
    "sort_key": "Ordenar chaves",
    "indent_size": "Tamanho da indentação"
  },
  "MACAddressLookup": {
    "title": "Consulta de endereço MAC",
    "description": "Esta ferramenta permite que você consulte rapidamente o fornecedor e o fabricante de um dispositivo com base no endereço MAC.",
    "mac_address": "Endereço MAC",
    "vendor_info": "Informações do fornecedor"
  },
  "textDiff": {
    "title": "Diferença de texto",
    "description": "Insira o texto em dois editores, e o algoritmo de comparação destacará as diferenças, tornando-o muito conveniente para usuários que precisam comparar textos."
  },
  "xssDefence": {
    "title": "Defesa contra XSS",
    "description": "Esta ferramenta identifica partes do seu código que podem estar vulneráveis a ataques XSS e as destaca. É muito útil e conveniente para aprender sobre XSS e se defender contra ataques XSS.",
    "remove": "Remover"
  }
}
