{
  "rsa": {
    "favorite": "Lieblingswerkzeuge",
    "title": "RSA-Schlüsselpaar-Generator",
    "description": "Dieses Tool ist ein Online-RSA-Schlüsselgenerator, der Benutzern hilft, schnell sichere RSA-öffentliche und private Schlüssel zu generieren. RSA (Rivest-Shamir-Adleman) ist ein weit verbreiteter kryptografischer Algorithmus mit öffentlichem Schlüssel, der hauptsächlich für die Datenverschlüsselung und digitale Signaturen verwendet wird.",
    "generate": "Schlüsselpaar generieren",
    "bits": "Bits",
    "public_key": "Öffentlicher Schlüssel",
    "private_key": "Privater Schlüssel"
  },
  "MD5": {
    "title": "MD5",
    "description": "Verwenden Sie MD5 (Message-Digest Algorithm 5), um Hash-Berechnungen auf Textinhalten durchzuführen.",
    "from": "Ihr String",
    "to": "Ergebnis"
  },
  "SHA": {
    "title": "SHA-Verschlüsselung",
    "description": "Verwenden Sie SHA1, SHA3, SHA224, SHA256, SHA384, SHA512, um Hash-Berechnungen auf Textinhalten durchzuführen.",
    "algorithm": "Algorithmus",
    "hash_length": "Hash-Länge",
    "from": "Ihr String",
    "to": "Ergebnis"
  },
  "RIPEMD": {
    "title": "RIPEMD",
    "description": "Eine Hash-Funktion basierend auf der MD4-Struktur, die einen 160-Bit- (20-Byte-) Hash-Wert ausgibt.",
    "from": "Ihr String",
    "to": "Ergebnis"
  },
  "AESEncrypt": {
    "title": "AES-Verschlüsselung",
    "description": "Verwenden Sie den AES-Algorithmus (Advanced Encryption Standard), um Text zu verschlüsseln und zu entschlüsseln. AES ist ein symmetrischer Verschlüsselungsalgorithmus, der auf Substitutions-Permutations-Netzwerken basiert.",
    "tag_length": "Tag-Länge",
    "additional_data": "Zusätzliche Daten",
    "from": "Ihr String",
    "to": "Verschlüsselter String"
  },
  "AESDecrypt": {
    "title": "AES-Entschlüsselung",
    "description": "Verwenden Sie den AES-Algorithmus (Advanced Encryption Standard), um Text zu verschlüsseln und zu entschlüsseln. AES ist ein symmetrischer Verschlüsselungsalgorithmus, der auf Substitutions-Permutations-Netzwerken basiert.",
    "tag_length": "Tag-Länge",
    "additional_data": "Zusätzliche Daten",
    "from": "Verschlüsselter String",
    "to": "Entschlüsselter String"
  },
  "base64EncodeDecode": {
    "title": "Base64 Kodierung/Dekodierung",
    "description": "Das Base64-Kodierungs-/Dekodierungstool wird verwendet, um Binärdaten in eine Textzeichenfolge zu kodieren oder Base64-kodierten Text wieder in Binärdaten zu dekodieren, was häufig für die Datenübertragung und -speicherung verwendet wird.",
    "encode_title": "Zu Base64",
    "decode_title": "Von Base64",
    "encode_from": "Ihr String",
    "encode_to": "Kodierter String",
    "decode_from": "Ihr Base64-String",
    "decode_to": "Dekodierter String"
  },
  "CSVToJSON": {
    "title": "CSV zu JSON Konverter",
    "description": "CSV ist ein Klartext-Dateiformat, das häufig zur Speicherung von tabellarischen Daten verwendet wird. Es besteht aus durch Kommas getrennten Werten, wobei jeder Wert in Anführungszeichen steht und jede Zeile einen Datensatz darstellt.",
    "lowercase": "Kleinbuchstaben-Schlüssel"
  },
  "JSONToCSV": {
    "title": "JSON zu CSV Konverter",
    "description": "CSV ist ein Klartext-Dateiformat, das häufig zur Speicherung von tabellarischen Daten verwendet wird. Es besteht aus durch Kommas getrennten Werten, wobei jeder Wert in Anführungszeichen steht und jede Zeile einen Datensatz darstellt."
  },
  "YAMLToJSON": {
    "title": "YAML zu JSON Konverter",
    "description": "Die YAML/JSON-Konvertierung ist ein benutzerfreundliches Online-Tool, das Dateien vom YAML-Format in das JSON-Format umwandelt. Es ermöglicht eine nahtlose Konvertierung zwischen JSON und YAML, was es für Benutzer geeignet macht, die Daten verarbeiten, übertragen oder validieren müssen."
  },
  "JSONToYAML": {
    "title": "JSON zu YAML Konverter",
    "description": "Die YAML/JSON-Konvertierung ist ein benutzerfreundliches Online-Tool, das Dateien vom JSON-Format in das YAML-Format umwandelt. Es ermöglicht eine nahtlose Konvertierung zwischen JSON und YAML, was es für Benutzer geeignet macht, die Daten verarbeiten, übertragen oder validieren müssen."
  },
  "dateTimeConverter": {
    "title": "Datum-Uhrzeit-Konverter",
    "description": "Dieses Tool ermöglicht eine einfache Umwandlung zwischen verschiedenen Datums- und Zeitformaten."
  },
  "queryParamsToJSON": {
    "title": "Query-Parameter zu JSON Konverter",
    "description": "Konvertieren Sie bequem URL-Query-Parameter in das JSON-Format, um die Anzeige und Verwendung für Benutzer zu erleichtern."
  },
  "envToNetlifyToml": {
    "title": ".env zu netlify.toml Konverter",
    "description": "Dieses Tool ermöglicht eine schnelle und einfache Konvertierung von .env-Konfigurationsdateien in TOML-Konfigurationsdateien. TOML ist so konzipiert, dass es ein minimales Konfigurationsdateiformat ist, das leicht lesbar ist und eindeutig auf Hashtabellen abbildet. TOML kann in verschiedenen Sprachen einfach in Datenstrukturen geparst werden."
  },
  "imageToBase64Converter": {
    "title": "Bild zu Base64 Konverter",
    "description": "Das Bild-zu-BASE64-Kodierungstool ermöglicht es Ihnen, verschiedene Bildformate einfach in Base64 zu konvertieren. Ziehen Sie das Bild einfach in den dafür vorgesehenen Bereich, um den Vorgang abzuschließen! Die Base64-Kodierung eines Bildes kodiert die Bilddaten in eine Zeichenfolge, sodass Sie die Zeichenfolge anstelle der Bild-URL verwenden können.",
    "image": "Bild",
    "output": "Base64-Ausgabe",
    "img_tag": "Verwenden im <img>-Tag",
    "css": "Verwenden im CSS"
  },
  "integerBaseConverter": {
    "title": "Ganzzahl-Basis-Konverter",
    "description": "Das Basis-Konvertierungstool ermöglicht es Benutzern, Ganzzahlen zwischen beliebigen Basen zu konvertieren, mit integrierter Unterstützung für häufig verwendete Basen wie 2, 8, 10, 16 und 64.",
    "input": "Eingabezahl",
    "input_base": "Eingabebasis"
  },
  "colorConverter": {
    "title": "Farbkonverter",
    "description": "Das Farbkonvertierungstool ermöglicht es Benutzern, ihre Farbwerte schnell in andere Formate zu konvertieren und den Standardnamen der Farbe anzugeben. Unterstützte Formate umfassen hex, rgb, hsl, hwb, lch und cmyk."
  },
  "caseConverter": {
    "title": "Schriftart-Konverter",
    "description": "Das Schriftart-Konvertierungstool ermöglicht es Ihnen, Text schnell in das gewünschte Format zu konvertieren. Es ist sehr praktisch für die Umwandlung von Namenskonventionen, Titelformaten usw. Es umfasst Großbuchstaben, Kleinbuchstaben, camelCase, titleCase, constantCase, hyphenCase, PascalCase, pathCase und snake_case.",
    "Lowercase": "Kleinbuchstaben",
    "Uppercase": "Großbuchstaben",
    "Camelcase": "Camelcase",
    "Capitalcase": "Capitalcase",
    "Constantcase": "Constantcase",
    "Dotcase": "Dotcase",
    "Pascalcase": "Pascalcase",
    "PascalSnakeCase": "PascalSnakeCase",
    "Nocase": "Nocase",
    "KebabCase": "KebabCase",
    "Pathcase": "Pathcase",
    "Sentencecase": "Sentencecase",
    "Snakecase": "Snakecase",
    "Mockingcase": "Mockingcase",
    "TrainCase": "TrainCase"
  },
  "textToUnicode": {
    "title": "Text zu Unicode Konverter",
    "description": "Das Text-zu-Unicode-Konvertierungstool ermöglicht es Ihnen, den Unicode-Code für ein Zeichen leicht nachzuschlagen oder das Zeichen zu finden, das einem Unicode-Code entspricht. Es kann Text in Unicode-Codes stapelweise konvertieren oder Unicode-Codes stapelweise in Text umwandeln.",
    "encode_title": "Text zu Unicode",
    "decode_title": "Unicode zu Text",
    "encode_from": "Geben Sie den Text ein, der in Unicode konvertiert werden soll",
    "encode_to": "Unicode aus Ihrem Text",
    "decode_from": "Geben Sie Unicode ein, um es in Text zu konvertieren",
    "decode_to": "Text aus Ihrem Unicode"
  },
  "XMLToJSON": {
    "title": "XML zu JSON Konverter",
    "description": "Dieses Tool ermöglicht die schnelle Konvertierung von XML in JSON. Extensible Markup Language (XML) ermöglicht es Ihnen, Daten auf eine teilbare Weise zu definieren und zu speichern. XML unterstützt den Austausch von Informationen zwischen Computersystemen (z. B. Websites, Datenbanken und Drittanbieteranwendungen). Vordefinierte Regeln vereinfachen den Prozess der Übertragung von Daten im XML-Format über jedes Netzwerk, und der Empfänger kann diese Regeln verwenden, um die Daten genau und effizient zu lesen."
  },
  "JSONToXML": {
    "title": "JSON zu XML Konverter",
    "description": "Dieses Tool ermöglicht die schnelle Konvertierung von JSON in XML. Extensible Markup Language (XML) ermöglicht es Ihnen, Daten auf eine teilbare Weise zu definieren und zu speichern. XML unterstützt den Austausch von Informationen zwischen Computersystemen (z. B. Websites, Datenbanken und Drittanbieteranwendungen). Vordefinierte Regeln vereinfachen den Prozess der Übertragung von Daten im XML-Format über jedes Netzwerk, und der Empfänger kann diese Regeln verwenden, um die Daten genau und effizient zu lesen."
  },
  "markdownToHTML": {
    "title": "Markdown zu HTML Konverter",
    "description": "Dieses Tool ermöglicht es Ihnen, Ihre Markdown-Inhalte schnell in das HTML-Format zu konvertieren und bietet auch die Möglichkeit, es als PDF-Datei herunterzuladen."
  },
  "escapeHTMLEntities": {
    "title": "HTML-Entitäten escapen",
    "description": "Escapen Sie HTML-Entitäten wie <, >, &, \" und ', um sie sicher in andere Codeformate einzufügen und Fehler zu vermeiden.",
    "escape_title": "HTML-Entitäten escapen",
    "unescape_title": "HTML-Entitäten unescapen",
    "escape_from": "Ihr String",
    "escape_to": "Ihr escapeter String",
    "unescape_from": "Ihr escapeter String",
    "unescape_to": "Ihr unescapeter String"
  },
  "YAMLToTOML": {
    "title": "YAML zu TOML Konverter",
    "description": "Das YAML-zu-TOML-Online-Tool ermöglicht es Ihnen, YAML-Formatcode einfach in TOML-Format zu konvertieren."
  },
  "TOMLToYAML": {
    "title": "TOML zu YAML Konverter",
    "description": "Das TOML-zu-YAML-Online-Tool ermöglicht es Ihnen, TOML-Formatcode einfach in YAML-Format zu konvertieren."
  },
  "JSONToTOML": {
    "title": "JSON zu TOML Konverter",
    "description": "Dieses Tool ermöglicht es Benutzern, JSON-Daten einfach in TOML-Konfigurationen zu konvertieren, was nützlich ist, wenn Benutzer zwischen verschiedenen Konfigurationsdateiformaten konvertieren müssen."
  },
  "TOMLToJSON": {
    "title": "TOML zu JSON Konverter",
    "description": "Dieses Tool ermöglicht es Benutzern, TOML-Konfigurationen einfach in das JSON-Format zu konvertieren, was es für Benutzer bequem macht, TOML-Konfigurationen anzuzeigen."
  },
  "JSONFormatter": {
    "title": "JSON-Formatter",
    "description": "Der JSON-Viewer kann Ihre JSON-Daten verschönern und bietet nützliche Funktionen wie Suchen, Zusammenklappen, Erweitern, Pfad, Ersetzen und Hervorheben."
  },
  "URLEncodeDecoder": {
    "title": "URL-Kodierer/Dekodierer",
    "description": "Um bestimmte Sonderzeichen in URLs zu verwenden, können Sie dieses Tool verwenden, um Ihre URL zu kodieren. Sie können dieses Tool auch verwenden, um empfangene URLs zu dekodieren.",
    "encode_title": "URL-Kodierer",
    "decode_title": "URL-Dekodierer"
  },
  "URLParser": {
    "title": "URL-Parser",
    "description": "Dieses Tool ist so konzipiert, dass Benutzer die verschiedenen Komponenten einer URL, wie Protokoll, Domain, Port, Query-Parameter usw., klar und einfach anzeigen können.",
    "your_url": "Ihre zu parsende URL"
  },
  "MIMETypes": {
    "title": "MIME-Typen",
    "description": "Dieses Tool ermöglicht es Benutzern, schnell zwischen Dateitypen und MIME-Typen zu konvertieren. Es bietet auch eine schnelle Nachschlagetabelle.",
    "mime_to_extension": "MIME-Typ zu Dateierweiterung",
    "mime_to_extension_desc": "Erfahren Sie, welche Dateierweiterungen mit einem MIME-Typ verknüpft sind",
    "extension_to_mime": "Dateierweiterung zu MIME-Typ",
    "extension_to_mime_desc": "Erfahren Sie, welcher MIME-Typ mit einer Dateierweiterung verknüpft ist"
  },
  "basicAuthGenerator": {
    "title": "Basic Auth Generator",
    "description": "Generieren Sie schnell Basis-Authentifizierungsdaten, indem Sie einen Benutzernamen und ein Passwort eingeben, was es praktisch macht, Anfragen in Tools wie PostMan zu senden."
  },
  "XMLFormatter": {
    "title": "XML-Formatter",
    "description": "Formatieren und heben Sie XML schnell hervor, was es nützlich macht, XML-Daten anzuzeigen.",
    "indent": "Einzugsgröße",
    "collapse": "Inhalt zusammenklappen"
  },
  "JWTParser": {
    "title": "JWT-Parser",
    "description": "JWT schnell analysieren, um den Header, die Nutzlast und die Signatur zu erhalten, was zur Extraktion und Überprüfung von JWT-Daten nützlich ist und das Debuggen erleichtert.",
    "uppercase": "Großbuchstaben",
    "lowercase": "Kleinbuchstaben",
    "number": "Zahlen",
    "symbols": "Symbole",
    "length": "Länge",
    "generate": "Generieren"
  },
  "tokenGenerator": {
    "title": "Token-Generator",
    "description": "Generieren Sie zufällig Tokens basierend auf der Auswahl des Benutzers bezüglich der Zeichentypen und der Länge. Es kann Großbuchstaben, Kleinbuchstaben, Zahlen und Sonderzeichen enthalten.",
    "uppercase": "Großbuchstaben",
    "lowercase": "Kleinbuchstaben",
    "number": "Zahlen",
    "symbols": "Symbole",
    "length": "Länge",
    "generate": "Generieren"
  },
  "passwordGenerator": {
    "title": "Passwort-Generator",
    "description": "Generieren Sie zufällig starke Passwörter nach Ihren Bedürfnissen. Alle Vorgänge werden lokal im Browser ausgeführt, um Sicherheit und Datenschutz zu gewährleisten. Sie können die Länge anpassen und Großbuchstaben, Kleinbuchstaben, Zahlen und Sonderzeichen einbeziehen.",
    "uppercase": "Großbuchstaben",
    "lowercase": "Kleinbuchstaben",
    "number": "Zahlen",
    "symbols": "Symbole",
    "length": "Länge",
    "generate": "Generieren"
  },
  "hashText": {
    "title": "Text hashen",
    "description": "Verschlüsseln Sie Text mit MD5, SHA1, SHA256, SHA224, SHA512, SHA384, SHA3 oder RIPEMD160."
  },
  "bcrypt": {
    "title": "Bcrypt",
    "description": "Bcrypt ist eine adaptive Passwort-Hash-Funktion. Es basiert auf dem Blowfish-Verschlüsselungsalgorithmus und wurde speziell für die sichere Passwortspeicherung entwickelt.",
    "hash_from": "Ihr String",
    "salt_count": "Salt-Anzahl",
    "compare_title": "String mit Hash vergleichen",
    "compare_from": "Ihr String",
    "compare_to": "Ihr Hash",
    "match": "Übereinstimmung"
  },
  "encryptDecryptText": {
    "title": "Text verschlüsseln / entschlüsseln",
    "description": "Verschlüsseln und entschlüsseln Sie Text mit AES, TripleDES, Rabbit oder RC4.",
    "encrypt_title": "Verschlüsseln",
    "decrypt_title": "Entschlüsseln",
    "text": "Text",
    "secret_key": "Geheimschlüssel",
    "algorithm": "Algorithmus",
    "result": "Ergebnis"
  },
  "hmacGenerator": {
    "title": "HMAC-Generator",
    "description": "HMAC (Hash-basierter Message Authentication Code) ist ein nachrichtenauthentifizierungscode, der auf einer Hash-Funktion und einem geheimen Schlüssel basiert und zur Überprüfung der Integrität und Authentizität von Nachrichten verwendet wird. HMAC kann mit verschiedenen Hash-Funktionen wie MD5, SHA-1, SHA-3, SHA-224, SHA-256, SHA-384, SHA-512 und RIPEMD160 verwendet werden.",
    "text": "Klartext",
    "secret_key": "Geheimer Schlüssel",
    "algorithm": "Hash-Funktion",
    "output_encode": "Ausgabe-Codierung",
    "output": "HMAC Ihres Textes"
  },
  "crontabGenerator": {
    "title": "Crontab-Generator",
    "description": "Geben Sie einen Cron-Ausdruck ein und übersetzen Sie ihn in eine für Menschen lesbare Sprache, mit einer Schnellreferenztabelle für Cron-Ausdrücke."
  },
  "SQLFormatter": {
    "title": "SQL-Formatter",
    "description": "Formatieren Sie unorganisierte SQL-Abfragen, um sie leichter lesbar und verständlich zu machen. Es kann auch SQL vor der Code-Einreichung verschönern, was die Wartung erleichtert.",
    "from": "SQL-Abfrage",
    "to": "Verschönerte Version Ihrer Abfrage",
    "dialect": "Dialekt",
    "keyword_case": "Schreibweise der Schlüsselwörter",
    "indent_style": "Einzugsstil"
  },
  "javascriptMinify": {
    "title": "JavaScript-Minimierung",
    "description": "Die JavaScript-Code-Minimierung bezieht sich auf den Prozess, alle unnötigen Zeichen aus dem Quellcode zu entfernen, ohne dessen Funktionalität zu ändern. Diese unnötigen Zeichen umfassen häufig Leerzeichen, Zeilenumbrüche, Kommentare und Blockbegrenzer, die zur Verbesserung der Lesbarkeit des Codes verwendet werden, aber für die Ausführung nicht erforderlich sind.",
    "from": "Ihr Code",
    "to": "Minimierter Code"
  },
  "YAMLFormatter": {
    "title": "YAML-Formatter",
    "description": "Das YAML-Formatierungstool kann YAML-Konfigurationen verschönern und hervorheben, was die Lesbarkeit verbessert und die Wartung erleichtert.",
    "sort_key": "Schlüssel sortieren",
    "indent_size": "Einzugsgröße"
  },
  "MACAddressLookup": {
    "title": "MAC-Adressen-Suche",
    "description": "Dieses Tool ermöglicht es Ihnen, schnell und einfach den Hersteller und Anbieter eines Geräts basierend auf seiner MAC-Adresse nachzuschlagen.",
    "mac_address": "MAC-Adresse",
    "vendor_info": "Anbieterinformationen"
  },
  "textDiff": {
    "title": "Textvergleich",
    "description": "Geben Sie Text in zwei Editoren ein, und der Vergleichsalgorithmus hebt die Unterschiede hervor, was es sehr praktisch für Benutzer macht, die Text vergleichen müssen."
  },
  "xssDefence": {
    "title": "XSS-Abwehr",
    "description": "Dieses Tool identifiziert Teile Ihres Codes, die anfällig für XSS-Angriffe sein könnten, und hebt sie hervor. Es ist sehr nützlich und praktisch, um über XSS zu lernen und sich gegen XSS-Angriffe zu verteidigen.",
    "remove": "Entfernen"
  }
}
