{
  "rsa": {
    "title": "Generator par kluczy RSA",
    "description": "To narzędzie to internetowy generator kluczy RSA, zaprojektowany, aby pomóc użytkownikom szybko generować bezpieczne publiczne i prywatne klucze RSA. RSA (Rivest-Shamir-Adleman) to szeroko stosowany algorytm kryptograficzny z kluczem publicznym, głównie używany do szyfrowania danych i podpisów cyfrowych."
  },
  "MD5": {
    "title": "Szyfrowanie MD5",
    "description": "Użyj MD5 (Message-Digest Algorithm 5), aby wykonać obliczenia skrótu na zawartości tekstowej."
  },
  "SHA": {
    "title": "Szyfrowanie SHA",
    "description": "Użyj SHA1, SHA3, SHA224, SHA256, SHA384, SHA512, aby wykonać obliczenia skrótu na zawartości tekstowej."
  },
  "RIPEMD": {
    "title": "RIPEMD",
    "description": "Funkcja haszująca oparta na strukturze MD4, generująca wartość haszującą o długości 160 bitów (20 bajtów)."
  },
  "AESEncrypt": {
    "title": "Szyfrowanie AES",
    "description": "Użyj algorytmu AES (Advanced Encryption Standard) do szyfrowania i deszyfrowania tekstu. AES to symetryczny algorytm szyfrowania oparty na sieciach podstawień i permutacji."
  },
  "AESDecrypt": {
    "title": "Deszyfrowanie AES",
    "description": "Użyj algorytmu AES (Advanced Encryption Standard) do szyfrowania i deszyfrowania tekstu. AES to symetryczny algorytm szyfrowania oparty na sieciach podstawień i permutacji."
  },
  "base64EncodeDecode": {
    "title": "Kodowanie/Dekodowanie Base64",
    "description": "Narzędzie do kodowania/dekodowania Base64 służy do kodowania danych binarnych na ciąg tekstowy lub dekodowania tekstu zakodowanego w Base64 z powrotem na dane binarne, często używane do transmisji i przechowywania danych."
  },
  "CSVToJSON": {
    "title": "Konwerter CSV na JSON",
    "description": "CSV to format pliku tekstowego, który jest powszechnie używany do przechowywania danych tabelarycznych. Składa się z wartości oddzielonych przecinkami, z każdą wartością ujętą w cudzysłów, a każda linia reprezentuje jeden rekord."
  },
  "JSONToCSV": {
    "title": "Konwerter JSON na CSV",
    "description": "CSV to format pliku tekstowego, który jest powszechnie używany do przechowywania danych tabelarycznych. Składa się z wartości oddzielonych przecinkami, z każdą wartością ujętą w cudzysłów, a każda linia reprezentuje jeden rekord."
  },
  "YAMLToJSON": {
    "title": "Konwerter YAML na JSON",
    "description": "Konwersja YAML/JSON to łatwe w użyciu narzędzie online, które konwertuje pliki z formatu YAML na format JSON. Umożliwia płynną konwersję między JSON a YAML, co jest przydatne dla użytkowników potrzebujących obsługi, przesyłania lub walidacji danych."
  },
  "JSONToYAML": {
    "title": "Konwerter JSON na YAML",
    "description": "Konwersja YAML/JSON to łatwe w użyciu narzędzie online, które konwertuje pliki z formatu JSON na format YAML. Umożliwia płynną konwersję między JSON a YAML, co jest przydatne dla użytkowników potrzebujących obsługi, przesyłania lub walidacji danych."
  },
  "dateTimeConverter": {
    "title": "Konwerter daty i czasu",
    "description": "To narzędzie umożliwia łatwą konwersję między różnymi formatami daty i czasu."
  },
  "queryParamsToJSON": {
    "title": "Konwerter parametrów zapytania na JSON",
    "description": "Wygodnie konwertuj parametry zapytania URL na format JSON, co ułatwia ich przeglądanie i używanie."
  },
  "envToNetlifyToml": {
    "title": ".env na netlify.toml konwerter",
    "description": "To narzędzie umożliwia szybką i łatwą konwersję plików konfiguracyjnych .env na pliki konfiguracyjne TOML. TOML został zaprojektowany jako minimalny format plików konfiguracyjnych, który jest łatwy do odczytania i jednoznacznie mapowany na tablice mieszające. TOML można łatwo parsować do struktur danych w różnych językach."
  },
  "imageToBase64Converter": {
    "title": "Konwerter obrazów na Base64",
    "description": "Narzędzie do kodowania obrazów na Base64 umożliwia łatwe konwertowanie różnych formatów obrazów na Base64. Wystarczy przeciągnąć obraz do wyznaczonego obszaru, aby zakończyć operację! Kodowanie Base64 obrazu koduje dane obrazu na ciąg, co pozwala używać ciągu zamiast adresu URL obrazu."
  },
  "integerBaseConverter": {
    "title": "Konwerter podstaw liczbowych",
    "description": "Narzędzie do konwersji podstaw liczbowych umożliwia użytkownikom konwersję liczb całkowitych między dowolnymi podstawami, z wbudowaną obsługą powszechnie używanych podstaw, takich jak 2, 8, 10, 16 i 64."
  },
  "colorConverter": {
    "title": "Konwerter kolorów",
    "description": "Narzędzie do konwersji kolorów umożliwia użytkownikom szybkie konwertowanie ich wartości kolorów na inne formaty i podaje standardową nazwę koloru. Obsługiwane formaty obejmują hex, rgb, hsl, hwb, lch i cmyk."
  },
  "caseConverter": {
    "title": "Konwerter wielkości liter",
    "description": "Narzędzie do konwersji wielkości liter umożliwia szybkie konwertowanie tekstu na żądany format. Jest bardzo wygodne do konwersji konwencji nazewnictwa, formatów tytułów itp. Obejmuje wielkie litery, małe litery, camelCase, titleCase, constantCase, hyphenCase, PascalCase, pathCase i snake_case."
  },
  "textToUnicode": {
    "title": "Konwerter tekstu na Unicode",
    "description": "Narzędzie do konwersji tekstu na Unicode umożliwia łatwe wyszukiwanie kodu Unicode dla znaku lub znalezienie znaku odpowiadającego kodowi Unicode. Może masowo konwertować tekst na kody Unicode lub masowo konwertować kody Unicode na tekst."
  },
  "XMLToJSON": {
    "title": "Konwerter XML na JSON",
    "description": "To narzędzie umożliwia szybką konwersję XML na JSON. XML (Extensible Markup Language) pozwala na definiowanie i przechowywanie danych w sposób możliwy do udostępnienia. XML wspiera wymianę informacji między systemami komputerowymi (takimi jak strony internetowe, bazy danych i aplikacje innych firm). Zdefiniowane wcześniej zasady upraszczają proces przesyłania danych w formacie XML przez dowolną sieć, a odbiorca może użyć tych zasad do dokładnego i efektywnego odczytania danych."
  },
  "JSONToXML": {
    "title": "Konwerter JSON na XML",
    "description": "To narzędzie umożliwia szybką konwersję JSON na XML. XML (Extensible Markup Language) pozwala na definiowanie i przechowywanie danych w sposób możliwy do udostępnienia. XML wspiera wymianę informacji między systemami komputerowymi (takimi jak strony internetowe, bazy danych i aplikacje innych firm). Zdefiniowane wcześniej zasady upraszczają proces przesyłania danych w formacie XML przez dowolną sieć, a odbiorca może użyć tych zasad do dokładnego i efektywnego odczytania danych."
  },
  "markdownToHTML": {
    "title": "Konwerter Markdown na HTML",
    "description": "To narzędzie umożliwia szybkie konwertowanie zawartości Markdown na format HTML i oferuje również opcję pobrania jej jako pliku PDF."
  },
  "escapeHTMLEntities": {
    "title": "Znakowanie encji HTML",
    "description": "Znakowanie encji HTML, takich jak <, >, &, \" i ', aby można je było bezpiecznie wstawiać do innych formatów kodu, zapobiegając błędom."
  },
  "YAMLToTOML": {
    "title": "Konwerter YAML na TOML",
    "description": "Narzędzie online YAML na TOML umożliwia łatwe konwertowanie kodu w formacie YAML na format TOML."
  },
  "TOMLToYAML": {
    "title": "Konwerter TOML na YAML",
    "description": "Narzędzie online TOML na YAML umożliwia łatwe konwertowanie kodu w formacie TOML na format YAML."
  },
  "JSONToTOML": {
    "title": "Konwerter JSON na TOML",
    "description": "To narzędzie umożliwia użytkownikom łatwą konwersję danych JSON na konfigurację TOML, co jest przydatne dla użytkowników potrzebujących konwersji między różnymi formatami plików konfiguracyjnych."
  },
  "TOMLToJSON": {
    "title": "Konwerter TOML na JSON",
    "description": "To narzędzie umożliwia użytkownikom łatwą konwersję konfiguracji TOML na format JSON, co jest wygodne dla użytkowników potrzebujących przeglądania konfiguracji TOML."
  },
  "JSONFormatter": {
    "title": "Formatowanie JSON",
    "description": "Przeglądarka JSON może upiększyć twoje dane JSON i oferuje przydatne funkcje, takie jak wyszukiwanie, zwijanie, rozwijanie, ścieżka, zamiana i podświetlanie."
  },
  "URLEncodeDecoder": {
    "title": "Kodowanie/Dekodowanie URL",
    "description": "Aby umożliwić używanie specjalnych znaków w URL, możesz użyć tego narzędzia do kodowania swojego URL. Możesz również użyć tego narzędzia do dekodowania otrzymanych URL."
  },
  "URLParser": {
    "title": "Parser URL",
    "description": "To narzędzie zostało zaprojektowane, aby umożliwić użytkownikom wyraźne i łatwe przeglądanie różnych składników URL, takich jak protokół, domena, port, parametry zapytania itp."
  },
  "MIMETypes": {
    "title": "Typy MIME",
    "description": "To narzędzie umożliwia użytkownikom szybkie konwertowanie między typami plików a typami MIME. Oferuje również szybką tabelę wyszukiwania."
  },
  "basicAuthGenerator": {
    "title": "Generator podstawowego uwierzytelniania",
    "description": "Szybko generuj dane uwierzytelniające poprzez wprowadzenie nazwy użytkownika i hasła, co jest wygodne do wysyłania żądań w narzędziach takich jak PostMan."
  },
  "XMLFormatter": {
    "title": "Formatowanie XML",
    "description": "Szybko formatuj i podświetl XML, co jest przydatne do przeglądania danych XML."
  },
  "JWTParser": {
    "title": "Parser JWT",
    "description": "Szybko parsuj JWT, aby uzyskać nagłówek, ładunek i podpis, które mogą być użyte do wyodrębnienia i weryfikacji danych JWT, co jest przydatne do debugowania."
  },
  "tokenGenerator": {
    "title": "Generator tokenów",
    "description": "Losowo generuj tokeny na podstawie wyboru rodzaju znaków i długości przez użytkownika. Może zawierać wielkie litery, małe litery, liczby i specjalne symbole."
  },
  "passwordGenerator": {
    "title": "Generator haseł",
    "description": "Generuj losowe, silne hasła zgodnie z twoimi potrzebami. Wszystkie operacje są wykonywane lokalnie w przeglądarce, co gwarantuje bezpieczeństwo i prywatność. Możesz dostosować długość i uwzględnić wielkie litery, małe litery, liczby i specjalne symbole."
  },
  "hashText": {
    "title": "Haszowanie tekstu",
    "description": "Szyfruj tekst za pomocą MD5, SHA1, SHA256, SHA224, SHA512, SHA384, SHA3 lub RIPEMD160."
  },
  "bcrypt": {
    "title": "Bcrypt",
    "description": "Bcrypt to adaptacyjna funkcja haszowania haseł. Jest oparta na algorytmie szyfrowania Blowfish i jest specjalnie zaprojektowana do bezpiecznego przechowywania haseł."
  },
  "encryptDecryptText": {
    "title": "Szyfrowanie/Deszyfrowanie tekstu",
    "description": "Szyfruj i deszyfruj tekst za pomocą AES, TripleDES, Rabbit lub RC4."
  },
  "hmacGenerator": {
    "title": "Generator HMAC",
    "description": "HMAC (Hash-based Message Authentication Code) to kod uwierzytelniający wiadomości oparty na funkcji haszującej i tajnym kluczu, używany do weryfikacji integralności i autentyczności wiadomości. HMAC może być używany z różnymi funkcjami haszującymi, takimi jak MD5, SHA-1, SHA-3, SHA-224, SHA-256, SHA-384, SHA-512 i RIPEMD160."
  },
  "crontabGenerator": {
    "title": "Generator Crontab",
    "description": "Wprowadź wyrażenie cron i przetłumacz je na język zrozumiały dla człowieka, z szybką tabelą referencyjną dla wyrażeń cron."
  },
  "SQLFormatter": {
    "title": "Formatowanie SQL",
    "description": "Formatuj nieuporządkowany SQL, aby ułatwić jego czytanie i zrozumienie. Może również upiększyć SQL przed jego przesłaniem, co ułatwia utrzymanie."
  },
  "javascriptMinify": {
    "title": "Minimalizacja JavaScript",
    "description": "Minimalizacja kodu JavaScript odnosi się do procesu usuwania wszystkich niepotrzebnych znaków z kodu źródłowego bez zmiany jego funkcjonalności. Te niepotrzebne znaki często obejmują spacje, znaki nowej linii, komentarze i separatory bloków, które są używane do poprawy czytelności kodu, ale nie są wymagane do jego wykonania."
  },
  "YAMLFormatter": {
    "title": "Formatowanie YAML",
    "description": "Narzędzie do formatowania YAML może upiększać i podświetlać konfiguracje YAML, poprawiając czytelność i ułatwiając ich utrzymanie."
  },
  "MACAddressLookup": {
    "title": "Wyszukiwanie adresu MAC",
    "description": "To narzędzie umożliwia szybkie i łatwe wyszukiwanie dostawcy i producenta urządzenia na podstawie jego adresu MAC."
  },
  "textDiff": {
    "title": "Porównanie tekstu",
    "description": "Wprowadź tekst w dwóch edytorach, a algorytm porównawczy podświetli różnice, co jest bardzo wygodne dla użytkowników potrzebujących porównać tekst."
  },
  "xssDefence": {
    "title": "Obrona przed XSS",
    "description": "To narzędzie identyfikuje części twojego kodu, które mogą być podatne na ataki XSS i je podświetla. Jest bardzo przydatne i wygodne do nauki o XSS i obrony przed atakami XSS."
  }
}
