{
  "category": {
    "favorite": "Favoritverktyg",
    "crypto": "Krypto/Kodning",
    "converter": "Omvandlare",
    "web": "Webb",
    "development": "Utveckling",
    "network": "Nätverk",
    "text": "Text",
    "security": "Säkerhet"
  },
  "rsa": {
    "title": "RSA nyckelparsgenerator",
    "description": "Detta verktyg är en online RSA-nyckelgenerator som är utformad för att hjälpa användare att snabbt generera säkra RSA offentliga och privata nycklar. RSA (Rivest-Shamir-Adleman) är en allmänt använd kryptografisk algoritm med offentlig nyckel, främst använd för datakryptering och digitala signaturer.",
    "generate": "Generera nyckelpar",
    "bits": "Bitar",
    "public_key": "Offentlig nyckel",
    "private_key": "Privat nyckel"
  },
  "MD5": {
    "title": "MD5",
    "description": "Använd MD5 (Message-Digest Algorithm 5) för att utföra hashberäkningar på textinnehåll.",
    "from": "Din sträng",
    "to": "Resultat"
  },
  "SHA": {
    "title": "SHA kryptering",
    "description": "Använd SHA1, SHA3, SHA224, SHA256, SHA384, SHA512 för att utföra hashberäkningar på textinnehåll.",
    "algorithm": "Algoritm",
    "hash_length": "Hashlängd",
    "from": "Din sträng",
    "to": "Resultat"
  },
  "RIPEMD": {
    "title": "RIPEMD",
    "description": "En hashfunktion baserad på MD4-strukturen, som ger ett 160-bitars (20-byte) hashvärde.",
    "from": "Din sträng",
    "to": "Resultat"
  },
  "AESEncrypt": {
    "title": "AES kryptering",
    "description": "Använd AES (Advanced Encryption Standard) algoritmen för att kryptera och dekryptera text. AES är en symmetrisk krypteringsalgoritm baserad på substitutions-permutationsnätverk.",
    "tag_length": "Tagglängd",
    "additional_data": "Ytterligare data",
    "from": "Din sträng",
    "to": "Krypterad sträng"
  },
  "AESDecrypt": {
    "title": "AES dekryptering",
    "description": "Använd AES (Advanced Encryption Standard) algoritmen för att kryptera och dekryptera text. AES är en symmetrisk krypteringsalgoritm baserad på substitutions-permutationsnätverk.",
    "tag_length": "Tagglängd",
    "additional_data": "Ytterligare data",
    "from": "Krypterad sträng",
    "to": "Dekrypterad sträng"
  },
  "base64EncodeDecode": {
    "title": "Base64 Kodning/Avkodning",
    "description": "Base64 kodnings-/avkodningsverktyget används för att koda binär data till en textsträng eller avkoda Base64-kodad text tillbaka till binär data, vanligtvis använd för dataöverföring och lagring.",
    "encode_title": "Till base64",
    "decode_title": "Från base64",
    "encode_from": "Din sträng",
    "encode_to": "Kodad sträng",
    "decode_from": "Din base64-sträng",
    "decode_to": "Avkodad sträng"
  },
  "CSVToJSON": {
    "title": "CSV till JSON omvandlare",
    "description": "CSV är ett enkelt textfilformat som ofta används för att lagra tabulär data. Det består av värden separerade med kommatecken, där varje värde är inneslutet i dubbla citattecken, och varje rad representerar en post.",
    "lowercase": "gemener nycklar"
  },
  "JSONToCSV": {
    "title": "JSON till CSV omvandlare",
    "description": "CSV är ett enkelt textfilformat som ofta används för att lagra tabulär data. Det består av värden separerade med kommatecken, där varje värde är inneslutet i dubbla citattecken, och varje rad representerar en post."
  },
  "YAMLToJSON": {
    "title": "YAML till JSON omvandlare",
    "description": "YAML/JSON-konvertering är ett lättanvänt onlineverktyg som konverterar filer från YAML-format till JSON-format. Det möjliggör sömlös konvertering mellan JSON och YAML, vilket gör det användbart för användare som behöver hantera, överföra eller validera data."
  },
  "JSONToYAML": {
    "title": "JSON till YAML omvandlare",
    "description": "YAML/JSON-konvertering är ett lättanvänt onlineverktyg som konverterar filer från JSON-format till YAML-format. Det möjliggör sömlös konvertering mellan JSON och YAML, vilket gör det användbart för användare som behöver hantera, överföra eller validera data."
  },
  "dateTimeConverter": {
    "title": "Datum-tid omvandlare",
    "description": "Detta verktyg möjliggör enkel konvertering mellan olika datum- och tidsformat."
  },
  "queryParamsToJSON": {
    "title": "Query Params till JSON omvandlare",
    "description": "Konvertera enkelt URL-queryparametrar till JSON-format, vilket gör det lättare för användare att visa och använda."
  },
  "envToNetlifyToml": {
    "title": ".env till netlify.toml omvandlare",
    "description": "Detta verktyg möjliggör snabb och enkel konvertering av .env-konfigurationsfiler till TOML-konfigurationsfiler. TOML är utformat för att vara ett minimalt konfigurationsfilformat som är lätt att läsa och entydigt mappas till hash-tabeller. TOML kan enkelt parsas till datastrukturer i olika språk."
  },
  "imageToBase64Converter": {
    "title": "Bild till Base64 omvandlare",
    "description": "Verktyget för bild till BASE64-kodning gör det enkelt att konvertera olika bildformat till Base64. Dra bara bilden till det angivna området för att slutföra operationen! Base64-kodningen av en bild kodar bilddata till en sträng, vilket gör att du kan använda strängen istället för bildens URL.",
    "image": "Bild",
    "output": "Base64-utdata",
    "img_tag": "Använd i <img> tagg",
    "css": "Använd i CSS"
  },
  "integerBaseConverter": {
    "title": "Heltalsbas omvandlare",
    "description": "Basomvandlingsverktyget gör det möjligt för användare att konvertera heltal mellan valfri bas, med inbyggt stöd för vanliga baser som 2, 8, 10, 16 och 64.",
    "input": "Inmatat tal",
    "input_base": "Inmatningsbas"
  },
  "colorConverter": {
    "title": "Färgomvandlare",
    "description": "Färgomvandlingsverktyget gör det möjligt för användare att snabbt konvertera sina färgvärden till andra format och ger det standardiserade namnet på färgen. Stödda format inkluderar hex, rgb, hsl, hwb, lch och cmyk."
  },
  "caseConverter": {
    "title": "Case omvandlare",
    "description": "Case-omvandlingsverktyget gör att du snabbt kan konvertera text till önskat format. Det är mycket bekvämt för att konvertera namngivningskonventioner, titelformat etc. Det inkluderar gemener, versaler, camelCase, titleCase, constantCase, hyphenCase, PascalCase, pathCase och snake_case.",
    "Lowercase": "Gemener",
    "Uppercase": "Versaler",
    "Camelcase": "Camelcase",
    "Capitalcase": "Capitalcase",
    "Constantcase": "Constantcase",
    "Dotcase": "Dotcase",
    "Pascalcase": "Pascalcase",
    "PascalSnakeCase": "PascalSnakeCase",
    "Nocase": "Nocase",
    "KebabCase": "KebabCase",
    "Pathcase": "Pathcase",
    "Sentencecase": "Sentencecase",
    "Snakecase": "Snakecase",
    "Mockingcase": "Mockingcase",
    "TrainCase": "TrainCase"
  },
  "textToUnicode": {
    "title": "Text till unicode omvandlare",
    "description": "Text till Unicode-omvandlarverktyget gör det enkelt att slå upp Unicode-koden för ett tecken eller hitta tecknet som motsvarar en Unicode-kod. Det kan batchkonvertera text till Unicode-koder eller batchkonvertera Unicode-koder till text.",
    "encode_title": "Text till Unicode",
    "decode_title": "Unicode till Text",
    "encode_from": "Ange text för att konvertera till unicode",
    "encode_to": "Unicode från din text",
    "decode_from": "Ange unicode för att konvertera till text",
    "decode_to": "Text från din Unicode"
  },
  "XMLToJSON": {
    "title": "XML till JSON omvandlare",
    "description": "Detta verktyg möjliggör snabb konvertering av XML till JSON. Extensible Markup Language (XML) gör det möjligt att definiera och lagra data på ett delbart sätt. XML stöder utbyte av information mellan datasystem (såsom webbplatser, databaser och tredjepartsapplikationer). Fördefinierade regler förenklar processen att överföra data i XML-format över vilket nätverk som helst, och mottagaren kan använda dessa regler för att läsa data exakt och effektivt."
  },
  "JSONToXML": {
    "title": "JSON till XML omvandlare",
    "description": "Detta verktyg möjliggör snabb konvertering av JSON till XML. Extensible Markup Language (XML) gör det möjligt att definiera och lagra data på ett delbart sätt. XML stöder utbyte av information mellan datasystem (såsom webbplatser, databaser och tredjepartsapplikationer). Fördefinierade regler förenklar processen att överföra data i XML-format över vilket nätverk som helst, och mottagaren kan använda dessa regler för att läsa data exakt och effektivt."
  },
  "markdownToHTML": {
    "title": "Markdown till HTML omvandlare",
    "description": "Detta verktyg gör att du snabbt kan konvertera ditt Markdown-innehåll till HTML-format, och erbjuder även möjligheten att ladda ner det som en PDF-fil."
  },
  "escapeHTMLEntities": {
    "title": "Escape HTML-entiteter",
    "description": "Escape HTML-entiteter som <, >, &, \" och ' för att tillåta dem att säkert infogas i andra kodformat och förhindra fel.",
    "escape_title": "Escape HTML-entiteter",
    "unescape_title": "Återställ HTML-entiteter",
    "escape_from": "Din sträng",
    "escape_to": "Din sträng med escape",
    "unescape_from": "Din sträng med escape",
    "unescape_to": "Din återställda sträng"
  },
  "YAMLToTOML": {
    "title": "YAML till TOML omvandlare",
    "description": "YAML till TOML onlineverktyg gör det enkelt att konvertera YAML-formatkod till TOML-format."
  },
  "TOMLToYAML": {
    "title": "TOML till YAML omvandlare",
    "description": "TOML till YAML onlineverktyg gör det enkelt att konvertera TOML-formatkod till YAML-format."
  },
  "JSONToTOML": {
    "title": "JSON till TOML omvandlare",
    "description": "Detta verktyg gör det enkelt för användare att konvertera JSON-data till TOML-konfiguration, vilket är användbart för användare som behöver konvertera mellan olika konfigurationsfilformat."
  },
  "TOMLToJSON": {
    "title": "TOML till JSON omvandlare",
    "description": "Detta verktyg gör det enkelt för användare att konvertera TOML-konfigurationer till JSON-format, vilket gör det bekvämt för användare som behöver visa TOML-konfigurationer."
  },
  "JSONFormatter": {
    "title": "JSON Formatterare",
    "description": "JSON-visaren kan försköna din JSON-data och erbjuder användbara funktioner som sökning, kollapsa, expandera, sökväg, ersätta och markera."
  },
  "URLEncodeDecoder": {
    "title": "URL Kodare/avkodare",
    "description": "För att tillåta att viss specialtext används i URL:er kan du använda detta verktyg för att koda din URL. Du kan också använda detta verktyg för att avkoda URL:er du tar emot.",
    "encode_title": "URL kodare",
    "decode_title": "URL avkodare"
  },
  "URLParser": {
    "title": "URL parser",
    "description": "Detta verktyg är utformat för att låta användare tydligt och enkelt visa de olika komponenterna i en URL, såsom protokoll, domän, port, queryparametrar, etc.",
    "your_url": "Din URL att parsa"
  },
  "MIMETypes": {
    "title": "MIME-typer",
    "description": "Detta verktyg gör det möjligt för användare att snabbt konvertera mellan filtyper och MIME-typer. Det erbjuder också en snabb uppslagstabell.",
    "mime_to_extension": "Mime-typ till filändelse",
    "mime_to_extension_desc": "Vet vilka filändelser som är kopplade till en mime-typ",
    "extension_to_mime": "Filändelse till mime-typ",
    "extension_to_mime_desc": "Vet vilken mime-typ som är kopplad till en filändelse"
  },
  "basicAuthGenerator": {
    "title": "Grundläggande autentiseringsgenerator",
    "description": "Generera snabbt grundläggande autentiseringsuppgifter genom att ange ett användarnamn och lösenord, vilket gör det bekvämt för att skicka förfrågningar i verktyg som PostMan."
  },
  "XMLFormatter": {
    "title": "XML Formatterare",
    "description": "Formatera och markera XML snabbt, vilket gör det användbart för att visa XML-data.",
    "indent": "Indragstorlek",
    "collapse": "Kollapsa innehåll"
  },
  "JWTParser": {
    "title": "JWT parser",
    "description": "Analysera snabbt JWT för att få Header, Payload och Signature, vilket kan användas för att extrahera och verifiera JWT-data, vilket gör det användbart för felsökning.",
    "uppercase": "Versaler",
    "lowercase": "Gemener",
    "number": "Siffror",
    "symbols": "Symboler",
    "length": "Längd",
    "generate": "Generera"
  },
  "tokenGenerator": {
    "title": "Token Generator",
    "description": "Generera slumpmässigt tokens baserat på användarens val av teckentyper och längd. Det kan inkludera versaler, gemener, siffror och specialsymboler.",
    "uppercase": "Versaler",
    "lowercase": "Gemener",
    "number": "Siffror",
    "symbols": "Symboler",
    "length": "Längd",
    "generate": "Generera"
  },
  "passwordGenerator": {
    "title": "Lösenordsgenerator",
    "description": "Generera slumpmässigt starka lösenord enligt dina behov. Alla operationer utförs lokalt i webbläsaren, vilket garanterar säkerhet och integritet. Du kan anpassa längden och inkludera versaler, gemener, siffror och specialsymboler.",
    "uppercase": "Versaler",
    "lowercase": "Gemener",
    "number": "Siffror",
    "symbols": "Symboler",
    "length": "Längd",
    "generate": "Generera"
  },
  "hashText": {
    "title": "Hash text",
    "description": "Kryptera text med MD5, SHA1, SHA256, SHA224, SHA512, SHA384, SHA3 eller RIPEMD160."
  },
  "bcrypt": {
    "title": "Bcrypt",
    "description": "Bcrypt är en adaptiv lösenordshashningsfunktion. Den är baserad på Blowfish-krypteringsalgoritmen och är specifikt utformad för säker lösenordslagring.",
    "hash_from": "Din sträng",
    "salt_count": "Saltantal",
    "compare_title": "Jämför sträng med hash",
    "compare_from": "Din sträng",
    "compare_to": "Din hash",
    "match": "Matcha"
  },
  "encryptDecryptText": {
    "title": "Kryptera / dekryptera text",
    "description": "Kryptera och dekryptera text med AES, TripleDES, Rabbit eller RC4.",
    "encrypt_title": "Kryptera",
    "decrypt_title": "Dekryptera",
    "text": "Text",
    "secret_key": "Hemlig nyckel",
    "algorithm": "Algoritm",
    "result": "Resultat"
  },
  "hmacGenerator": {
    "title": "Hmac-generator",
    "description": "HMAC (Hash-baserad meddelandeautentiseringskod) är en meddelandeautentiseringskod baserad på en hashfunktion och en hemlig nyckel, som används för att verifiera integriteten och äktheten av meddelanden. HMAC kan användas med olika hashfunktioner som MD5, SHA-1, SHA-3, SHA-224, SHA-256, SHA-384, SHA-512 och RIPEMD160.",
    "text": "Klartext",
    "secret_key": "Hemlig nyckel",
    "algorithm": "Hashfunktion",
    "output_encode": "Utdata-kodning",
    "output": "HMAC av din text"
  },
  "crontabGenerator": {
    "title": "Crontab-generator",
    "description": "Ange ett cron-uttryck och översätt det till ett lättförståeligt språk, med en snabb referenstabell för cron-uttryck."
  },
  "SQLFormatter": {
    "title": "SQL-formaterare",
    "description": "Formatera oorganiserad SQL för enklare läsning och förståelse. Den kan också försköna SQL innan kodinlämning, vilket gör det lättare att underhålla.",
    "from": "SQL-fråga",
    "to": "Förskönad version av din fråga",
    "dialect": "Dialekt",
    "keyword_case": "Nyckelordsformat",
    "indent_style": "Indragstil"
  },
  "javascriptMinify": {
    "title": "Javascript-minifiering",
    "description": "JavaScript-kodminifiering avser processen att ta bort alla onödiga tecken från källkoden utan att ändra dess funktionalitet. Dessa onödiga tecken inkluderar ofta mellanslag, radbrytningar, kommentarer och blockavgränsare, som används för att förbättra kodens läsbarhet men inte krävs för exekvering.",
    "from": "Din kod",
    "to": "Minifierad kod"
  },
  "YAMLFormatter": {
    "title": "YAML-formaterare",
    "description": "YAML-formateringsverktyget kan försköna och markera YAML-konfigurationer, vilket förbättrar läsbarheten och gör underhåll enklare.",
    "sort_key": "Sortera nycklar",
    "indent_size": "Indragsstorlek"
  },
  "MACAddressLookup": {
    "title": "MAC-adressuppslagning",
    "description": "Detta verktyg gör det möjligt för dig att snabbt och enkelt slå upp leverantören och tillverkaren av en enhet baserat på dess MAC-adress.",
    "mac_address": "MAC-adress",
    "vendor_info": "Leverantörsinformation"
  },
  "textDiff": {
    "title": "Textjämförelse",
    "description": "Ange text i två redigerare, och jämförelsealgoritmen kommer att markera skillnaderna, vilket gör det mycket bekvämt för användare som behöver jämföra text."
  },
  "xssDefence": {
    "title": "XSS-försvar",
    "description": "Detta verktyg identifierar delar av din kod som kan vara sårbara för XSS-attacker och markerar dem. Det är mycket användbart och bekvämt för att lära sig om XSS och försvara sig mot XSS-attacker.",
    "remove": "Ta bort"
  }
}
